[
  "The food here was great! This was our first meal in Paris as it was close to our hotel. Luck find! We went back multiple times for quick meals and dessert. The sandwiches were great, the crepes were exceptional and we fell in love with the Nutella and ice cream crepe.\n\"Tom Cruise, Jr.\" is great- extremely friendly, fun and creative. He welcomed us in and chatted with us on the first visit and remembered us and details when we returned at a later date. And was friendly and entertaining to others eating as well.\nIncredibly friendly and glad we found this place.\nVery reasonable prices.\nSo fun sitting on the sidewalk enjoying the views.",
  "We had finished exploring the Louvre and were looking for lunch. Since we exited onto Rue Rivoli, I figured there would be someplace we could find as the block seemed to be lined with shops and eateries. I whipped out Yelp and noticed that I had Happy Caffe bookmarked. I'm not sure how it landed in my collection, but the reviews were excellent thought it would be a good option for lunch - so off we went.\n\nHappy sits right on the street - it's a super small space with barely any room inside and several tables outside on the sidewalk. They did a good job making room for us - I have to say they mastered the art of optimizing what little space they have but even still be prepared for a tight fit.\n\nThe menu has a selection of baked good, crepes, and sandwiches. We asked the employee working behind the counter what they recommended and he suggested the kebab panini as he sells many of them every day. We decided to each get one, which was served promptly.\n\nThe sandwich wasn't my favorite - the chicken seemed a little off, and it wasn't that tasty. I wouldn't say it was awful, but I also wouldn't order it again. Looking back, perhaps I ordered the wrong thing (despite it being recommended to me).\n\nI'm puzzled by all these 5-star reviews - maybe the crepes are better? Two stars for the friendly and attentive service, but I would bypass this spot next time I'm in Paris.",
  "For the price point and location on Rue de Rivoli, this place is alright. The servers are very friendly! My husband and I both had crepes and they were fine. The plates they serve them on are cute with the Eiffel Tower hand-drawn in mayo. The place itself is tiny but they have a few tables outside. It's not as cute of a setup as other places where you can \"watch the world go by\" but it's nice to sit outside to enjoy your meal (unless there are smokers just hanging around without regard for the diners, like there were when we were there).",
  "Awesome food, awesome service!\n\nI really wanted to get a crepe on our trip in Paris and figured I might as well check out Happy Caffe since it had great reviews. I ordered a sweet crepe with nutella, bananas, and strawberries with a freshly squeezed orange juice. My husband got a savory crepe with egg, ham, and cheese and a chocolate croissant. They make the crepes to order, so I watched him make ours! All the ingredients were very fresh. They even draw designs on the plates. Such as an Eiffel tower! My husband said he thinks it was the best crepe he has ever had, and I would agree with him! He also ordered a croissant to go. Their croissants are very good here!\n\nOur server who really is the main guy running the place is very personable. He is super funny and engaging with his customers! Also, he was very thoughtful. He brought me a bag clip so that I could hang my purse off the table instead of putting it on the ground. Our server even gave us a chocolate pudding on the house! I will definitely remember him! The ratings of this place are really a true reflection on how impacting good service can be for a restaurant!\n\nIt is a pretty small restaurant and are not too many tables in the restaurant. We were able to sit inside.\n\nGreat location if you are going to the Louvre!",
  "Stumbled upon this cafe and was happy with our food and especially our service. We had a few ham and cheese in a crossaint, which my son surpringly liked. I loved how it was served on a plate with a message. The staff was super friendly and that is the main reason they deserve five stars.",
  "Loved it. We wanted baguettes and found this place. It's a tiny place on the sidewalk with outdoor seating. The server was pretty funny. The price is right. Around 8 euro for a baguette. Highly recommend.",
  "My husband and I went to Happy Caffe on a cold and rainy day in January. It was cozy and warm in the small restaurant and the workers were so very kind and welcoming. We both got savory crepes and my husband got a sweet crepe afterwards. They were kind enough to give us recommendations and while the chef was making the crepes, we all discussed everything under the sun! I can't reiterate enough how friendly and hospitable everyone was. The crepes tasted phenomenal and I will definitely be coming back every visit to Paris from now on!!",
  "I don't understand why this restaurant has a 5 star rating. The ambiance could not be less special. It's a tiny little restaurant. The food was not good. The coffee was not good. The service was not great. There are tons of fantastic places to eat in Paris (probably even on that block), I would not recommend this place.",
  "I had the ham and cheese on a croissant and it was delicious. So good, in fact, that I came back later for another one. The staff are so kind and generous; they gave me a free glass of orange juice and some Biscoffs when I left. Most of the tables are outside though I managed to snag the one table inside both times and it was delightful. They have plenty of staff working and from what I could see food was served quickly and tables were bussed quickly also. It's in a great location! Very close to the Louvre and a nice park across the street. I highly recommend Happy Caffe!!",
  "Great food. We shared a vegetarian crepe and \"Oh my God\" sandwich. Both were amazing! Reasonable pricing and the owner was great to talk too.",
  "This tiny cafe was a hidden gem. Got a chicken Cesar and the chicken was amazing! Wait staff friendly & attentive.",
  "Do you ever come across employees who are so engaging that you wish you could clone them and put them in every establishment you visit? That's what we found here in the Happy Caffé. Our guy (who called himself Tom Cruise) was so quick-witted and charming, he went out of his way to engage with everyone who walked in the door. For his Spanish customers he introduced himself as Antonio Banderas Jr. - lol. \"Tom\" kept us laughing the whole time with his banter and humor, not to mention excellent service. Our ham and cheese crepe and Nutella, strawberry and banana crepe were both good and came with the extra flourish of an Eiffel Tower drawing on the plate. My bottled apple juice was sooo good. Wish they'd sell that in the States! I might not say the crepes were five star but Happy Caffé lives up to its name - you leave there feeling five star happy and satisfied thanks to the staff. It's conveniently located near the Louvre and Tuileries Garden.",
  "Quick seating for a small hole in the wall cafe! Has everything you want to eat in Paris! lol super quick ordering and close to monuments and stores!!",
  "So much fun! This is a must stop cafe for crepes and cappuccinos. The staff is incredibly friendly.",
  "Mr Tom Cruise is amazing! Great food, great service, and a nice little spot. And great prices too. Highly recommend.",
  "Great tasting food & drink.\nSuper friendly and kind staff.\nGood vibes while in Paris.\nGreat stop before heading into the Louvre.",
  "Like others, our experience here was a standout on our five-country Europe trip. Truly, it was that positive. First, best crepe of my life (strawberry, banana and Caramel). The caramel sauce was crazy good.\n\nSecond, the main guy was personable, funny, kind and went out of his way to really connect with us. You really would want this to be how every food establishment treated its customers. They deserve their high rating.\n\nDon't miss this experience. We went near closing and ordered right away. I heard there is a line during the day.",
  "Cute little cafe! The staff are very friendly and accommodating. We had a larger party and they put tables up to accommodate us. The crepes were amazing! Will definitely be back!",
  "Went here for a quick bite to eat, food was delicious. The owner took our order, and came to us multiple times to make sure we were taken care of. Made a couple jokes, and overall great experience!",
  "Our favorite crepe place in Paris. Tom Cruise always takes excellent care of us. It's small place but one you must try.",
  "Just dropped by for a cappuccino and croissant, it was awesome, the service was so fun, happy and welcoming\nAfter ordered the croissant my husband had to try the ham and cheese croissant... so yummy",
  "Stopped here while by the Lourve. The place is small, but the space is used efficiently. There are a few tables nearby to eat at if you want. Expect a wait if you are there around meal times. We waited about 20 minutes when we arrived at noon.\n\nThe two guys were very friendly and make the experience fun.... definitely a memorable service haha. I had a crepe with chicken, cheese, and egg and it was delicious and well seasoned. One portion is enough for a quick meal and the price was reasonable. Though they specialize in crepes (both sweet and savory), they also had sandwiches.\n\nWould recommend it to those in the area!",
  "Hi Jessica !!!!\nYou made our day !!!!\n\nTake care\nHappy team",
  "This is an absolutely fantastic cafe and bakery. Tom Cruise was just so much fun and I couldn't wait to come back each time!",
  "I am not sure what was better- our crepes or the man who served us our crepes because both were absolutely wonderful! The ham, egg,and cheese (a little better than the chicken) were delicious as was the Nutella with banana and strawberries. I had my three daughter with me and the server was hysterical and sang to us and created works of art (the Eiffel Tower and the Mona Lisa) on our plates using bottles of ketchup and mayo. We had so much fun and the food was so good, we came back the next day!",
  "I took my daughter to Paris this summer and this was our favorite spot! The people who work here are some of the kindest and most fun we've ever met at any restaurant, and the crepes are INCREDIBLE. We ended up going there for breakfast every day.\n\nDo yourself a favor and check it out.",
  "Being from South Texas, I get to eat a crepe about once every five years, so you know I'm no expert, but this little hole in the wall has the best I've ever experienced. However, an equally good reason to come here is to experience the wonderful and entertaining service provided by its Indian owner.\n\nMy ham, cheese, and tomato crepe was more than enough for me, but a bigger, younger person would be able to add a dessert crepe and be satiated.\n\nProximity to the Louvre makes this a perfect place to eat, and if you're lucky like we were to get a table immediately, it is the perfect meal.\n\nCongratulations, Daddy, on your wonderful enterprise! We cherish our video of your performance.",
  "Ham and cheese croissant was delicious! And the man who runs the cafe is genuinely one of the most positive and nicest human beings to exist! Highly recommend visiting",
  "Antonio banderas jr was the best . Top notch service with excellent food , if you are around and looking for a bite to eat look no further .",
  "Absolutely wonderful staff and food!\nThe people who run this spot are very welcoming and have plenty of conversation!",
  "This was an amazing crepe spot and the guys who work there we beyond friendly and provided awesome service! My boys loved the atmosphere and we are so glad we stopped by for a break after the Louvre.",
  "Cute little nook for a croissant and coffee with a lovely view of the park. Service was fast and very friendly.",
  "The worker was very nice. He pretended to be Donald Trump because we were visiting from America it was very funny. The food was good and cheap, which was nice. Small indoor seating, so we took ours to go. Overall good quick meal.",
  "Though not there entire fault they had no crepes as they were on auxiliary power due to street work which was told not enough to make crepes. The ham and cheese croissant I got okay. Not sure why they draw in mayo ant ketchup on plate. As does not go with item. Some mustard I could see as people do put that on ham and cheese but I know no one who puts ketchup on this type of food. Orange juice was not a full glass and maybe due to same power issue had no ice.",
  "Wonderful spot for a nice brunch. Everyone was kind and patient (our French is virtually nonexistent lol), but they handled it well. The food was great and so were the drinks!",
  "THE SWEETEST WORKER EVER! literally made my night in Paris. The crepes are so fresh and delicious, def make sure to stop by.",
  "Hi Alex H !!!\n….for the more sympathetic customers !!!\n\nTake care\nHappy team",
  "Five stars for happ\"y\"ness and service! The owner is super friendly and greeted us in English, while talking to neighboring tables in other languages as proficiently (Spanish, French, etc). He made many jokes to keep our kids entertained. It was a good stop to start our afternoon of museums. The food was ok, our group liked the simple croissant sandwiches the best. Overall can recommend for great service and reasonable prices for the area.",
  "This was our first pit stop upon arrival in Paris and I tell you, for me, they make one of the best crepes I've ever had. I tried the vegetarian crepe and loved it. It's flavorful without it being salty. The staff was so nice and friendly. The seats outside are limited (most people just buy food to go anyway). I recommend this for everyone to try.",
  "Thanks a lots in the bottom of my heart…because of your lovely words you let me speechless.\n\nTake care\nHappy team",
  "Very friendly staff. Patient and its only $10 for croissant latte and dessert. Super close to the louve. Most places a breakfast is 20+ just for a dish!",
  "We were starving and this place got good reviews so yeah we got in the long ass line and waited for some crepes. I waited for a good 45-1hour! Gahhh. Good thing the kids were busy shopping at the nearby souvenir shops. The workers are friendly. We got:\n\nSavory crepes: 4/5 they were cheesy and yummy\n\nTuna sandwich: 4/5 good solid sandwich.\n\nI thought there was a long line due to the great location right across from le jardin de tulleries but they serve up some solid food at reasonable prices.\n\nPs prices are double to dine in. We grabbed our food and enjoyed it in the beautiful jardin.",
  "Hi Kim !!!!\nWe were very happy to made you happy !!!\nSorry for the time that it takes to make your crepe, but we have a lot of orders, and because we do all fresh, it takes more time.\n\nTake care\nHappy team",
  "Best Nutella crepes I've had in years!! The service is great, and the atmosphere is very pleasant. Everyone is super friendly. Do yourselves a favor and try this place. Skip the tourist places and come here.",
  "The owner here is super nice. The food is amazing. Highly recommended, no matter what you like.",
  "Great food! great service! Highly recommend to anyone near and around the Louvre. Owner is very nice and made sure to check in and ask about everything.",
  "Stopped for lunch at the Happy Caffe. Had a crepe with strawberries, bananas and honey. It was outstanding. The strawberries very very fresh and flavorful. The man running the place told me his name was Tom Cruise, was very entertaining mingling and conversing with all the patrons. He made sure to try and talk to all the patrons and make them each feel special. So I got a fabulous tasting crepe and a show to go along with it. Can't ask for more.",
  "The service was fantastic and very prompt. He takes great pride in his work, it is evident! Fantastic food, right on the street, fun place to be. Highly recommend.",
  "We had a Truly great experience here. Wonderful service, excellent coffee and pastries. Highly recommend for a quick stop .",
  "The food and service is superb. It's a typical Parisian coffee place. Their attention to detail makes it so different from others. It's a small cafe with great people that will make your morning great. Thanks for the excellent breakfast. Try the OMG! The name speaks for itself.",
  "Love love love this place!! Food is fantastic!! Service is even better! Stop for breakfast, lunch or a light dinner or snack! You will be so Happy!",
  "Good food. Excellent service. Reasonably priced.\nIt was a nice stop in the middle of the city.",
  "Yummy desserts, not very good sandwich yet a delightful and friendly server. If you are accustomed to a Jimmy John's or Jersey Mikes, you will be very disappointed with these sandwiches.\n\nCrepe machine was down unfortunately.",
  "The staff are so courteous and helpful. Very friendly and speak multiple languages.\nThe sandwich selection is really good quality and delicious.",
  "What a friendly group of people that work here! They really live up to their name. Given that it's very centrally located, I think we were lucky to get the prices we did - for fresh, delicious crepes and food. The servers made cordial conversation for us while making the food, and we really felt welcomed. It was so good, we wish we were able to stop by more than once, to be honest.\n\nThe food itself was flavored well, made fresh in front of your eyes. I got the egg and cheese, and my husband got the chicken crepe. Both were extremely delicious, hot (which was great for the freezing weather), and flavored/salted really well.\n\nI'd go back in a heart beat!!!!",
  "Great little sidewalk Cafe. The food & coffee ate fantastic. And the customer service is amazing!",
  "Great place treated us very nice! Service perfect. Could not have been nicer and food and coffee were great!",
  "First crepe in paris, right along the Louvre area! The man who ran the place was super friendly and nice, made it a welcoming place to eat. There's a dine in fee of 1-2€ a dish, which was fine since we wanted to sit down anyways and the man was super nice. I got the ham, cheese and egg crepe with hot chocolate. The crepe was really filling and savory! The egg was really crispy and there was a generous amount of ham and cheese. The hot chocolate was perfect for the rainy weather, and the man added more caramel into mine since he saw I liked more sweet drinks.",
  "Hi Lucy !!!!!\nIt was a real pleasure to serve you and to bring the smile on your face.\n\nTake care\nHappy team",
  "A 3 star establishment at best. It's located right behind the Tuileries Garden. I sauntered in because it was right by my hotel and it was late and I needed sustenance. My Nutella crepe was very oily, and the croque Monsieur was just average. There are worse places in Paris, but there are also much better places. Mostly a tourist locale. The high rating is somewhat puzzling.",
  "Hi Lucy !!!\nThank you for having our fresh homemade products.\nOur target is not to be average. We work hard in order to give you the best ! About your Nutella crepe you have to know that we melt a small switch, that butter half salt organic. You probably don’t like it, but in they love it ! For the croque Monsieur, what is just average ? You know Lucy, between what you are expecting and what you will get, their is sometimes a gap. Anyway we try to do better every day.\n\nTake care\nHappy team",
  "Great crepes. Friendly advice. Priced right. Close to the Westin and the Louvre. Came with a sweet treat at the end.",
  "Mr Happy ... took care of us. My fave wine . My hubby and I luv their food. If ever in Paris. Come here . Thank me later and Mr Happy",
  "The name of this place really matches the vibe of this small but cozy restaurant! The owners of this shop are so friendly and made us feel so welcomed. We got a savory crepe with ham egg and cheese as well as the New Yorker baguette it was delicious and the price was good for a tourist area!",
  "Hi Ruby !!!!\nMany many thanks !!! I just wake up and I saw your lovely review. It was an honour to serve you, and you light up our day !!!!\n\nTake care\nHappy team",
  "Amazing service, fun staff and the best crepes in Paris. Do not skip this stop!!! Worth stopping and you will return.",
  "The service was amazing. Easily the nicest person I've met at any restaurant in the world.\n\nThe food was soooo good. We had an omelet, chicken sandwich, ham and cheese croissant, chocolate croissant, and more. Amazing food. I'll definitely come back during this trip.",
  "Friendly service. We had a quick lunch here. My son had a tomato and cheese crepe which was delicious and I had a bacon salad which came with tomato, avocado, what I would call thin slices fried ham, olives, sliced pickles and corn with a ranch type dressing. The lettuce was fresh but underwhelming. everything else was fine. My son also ordered a mango boba tea and the boba was the style which popped in your mouth and was very good. The owner even came out and gave a free refill, without being asked, which was very nice.\n\nThere aren't many tables here, so it is a hot day you may be in the sun.",
  "Kids loved it, service was great, got three different crepes and dessert, everything was quick, reasonably priced and the service was so friendly/fun",
  "Great food and service. Dude mega chill sadwitch was good, solid advice got a ham and cheese sandwich",
  "c'est fantastique. les crepes, le service, le people-watching! on va retournez encore mercredi.",
  "This was such a lovely little gem we stumbled upon after our walk through JARDIN DES TUILERIES - we got the best strawberry Nutella croissant and cappuccino! The service was wonderful! Merci xx",
  "Antonio Banderas was what our waiter called himself and he was so fun! Service was excellent & food was super yummy too! Enjoyed people watching while sipping a glass of wine and the chicken kabob sandwiches were super yummy too! Loved our waiters sense of humor! When you go ask for \"Antonio Banderas\" you'll enjoy good food with lots of fun!",
  "Wonderful service and great food.....and great prices too!!!! Can't stress enough how wonderful the owner is",
  "Everything is great, the owner is very humorous and kind, though I'd like a bigger table xoxo",
  "Tom Cruise jr #1 service he is the best. The restaurant has delicious food and is close to the Louvre",
  "The crepes are so delicious. We had both the sweet and savory crepes. The service was excellent. Our waiter was super funny. The location is across from the Louvre.",
  "Happy indeed! Such a lovely little spot for a quick bite. Owner was very kind to our family and food was perfect! We went twice we enjoyed it so much. It has a great location too.",
  "Great food. Wonderful people. We had baguette with chicken and avocado the girls had crepes",
  "This cafe is a wonderful place to sit and enjoy Paris! The service is very friendly and the food is tasty. Although the crepes were not available due to electrical issues, I would love to be back to try the crepes. We had sandwiches, croissants and a combination of espressos and coffees. Great place for a quick bite or a leisurely snack.",
  "This place was amazing. \"Tom Cruise\" was incredibly funny, playful and glad to see us. The food was so good. The crepes were delicious. This is a little hole in the wall place that you need to try.",
  "Hi Roy !!!\nTom Cruise is very happy and proud to serve you !\nMany many thanks !\n\nTake care\nHappy team",
  "Strolled in here after hungry pains of an all day tour and really it topped the end of our Paris experience. We were warmly welcomed by a humorous gentleman (I sadly did not get this name). The place is small, busy and tight but it is worth it. We had an egg/cheese/chicken crepe, Cesar chicken salad, banana/strawberry/Nutella crepe and honestly the best crepes I've ever had in my life! The salad was also very fresh, tasty and filling. The egg crepe was perfect, full of flavors and very filling. What made this place unique though was the attention of the humorous gentleman running the show so calmly and efficiently under so much demand. He made the whole thing great with his quirky and fun comments to everyone. Much respect to that gentleman running a very busy spot with lots of love to his customers (impressively speaks like 6 languages!) I told him in the USA, we have never received such incredible service whilst juggling orders, running food, taking payments and helping on the line - this man needs a tremendous raise. But do try this place! Excellent food, obviously the service and fair prices!",
  "Many many thanks !!!\nThe name of the gentleman is KRISHAN.",
  "Great owner and a must stop for breakfast. This is the first time that I am visiting Paris. Looking for a light and tasty breakfast that isn't too far away from all of the tourist attractions. This is the perfect place for that. Owner speaks both English and Spanish outside of French so you won't have to worry about language barrier. You must try their hot chocolate and OH MY God sandwich.",
  "In A Nutshell:\n\n-Happy Caffe in Paris, is located right across the street from the Tuileries Garden.\n-So if you are staying in the 1st Arrondissement, start your morning off by walking to this small, sidewalk cafe, which serves up some tasty crepes, then walk across the street to the park to enjoy it.\n-The crepes are made fresh right in front of you & I highly recommend the tuna fish crepe.\n\nOverall, this was a nice find & I hope you get to enjoy the crepes here soon!",
  "The Happy Caffè is this tucked away tiny place you usually wouldn't give second notice to, but the people are the nicest you will meet, they are truly happy, and the food is really quite good. The location is absolutely perfect, right across from the Tuileries and if you're looking for a quick snack or breakfast spot that doesn't cost an arm and a leg, this is the place to go. Even better they go out of the way to remember regular customers and make everyone feel welcome and experience the magic of Paris.",
  "Really nice man running it. It doesn't look like much, but we had the \"oh my god\" chicken sandwich (think mild curry). It was delicious.",
  "Wonderful service and food! We tried a variety of sweet and savory crepes, beignets, tiramisu and it was all super tasty. Although the shop is pretty small, it just ads to the bustling ambiance. The staff is super friendly and jokes around with the customers while providing efficient service. Don't miss this spot during your visit!",
  "We had a lot of crepes in Paris but these were by far the best! Christian is also super friendly, speaks multiple languages fluently, and was super nice, friendly, entertaining, and amazing service. We went back several times and would highly recommend",
  "The food is wonderful ant the owner is the best!!!! Have a happy time at the Happy Caffe.",
  "Great food and friendliest staff!!!! It was a delight to find this gem! Treat yourself",
  "Sandwiches and crepes were amazing but what really made it fun was \"Tom Cruise\" serving us. He was so funny and clearly exemplifies being a Happy Cafè! This place is a great spot for lunch or dessert. Would go back again for sure! Worth a little walk out of your way for small business with a great atmosphere!",
  "The owner of this place is super friendly, he speaks at least 5 languages and welcomes everyone with a smile and a joke. The food is great, especially the toasted ham and cheese sandwiches. Highly recommend this place if you need a break from sightseeing!!",
  "It's the first breakfast when we are in Paris and it impressed us a lot - the food and the service. Patel is very kind and friendly. And the food is super! Especially, you can grab it during early morning on Sunday - which save my stomach After the breakfast, it's easy to have a walk around the Jardin des Tuileries cuz it's really close to it.",
  "Happy Cafe lives up to its name. It is happy! The gentleman serving that day was hilarious and professional. He read my mind, ordered for me, and held a conversation with me as he flawlessly made my perfect crepe. I was hungry and my brain does not work when that happens. He is reasonably priced crepe wise and coffee wise. Don't go anywhere else for coffee or a crepe! Everyone else will rip you off. He does not offer seating, but you are right next to a gorgeous park. Go sit in it. You will fill better after that anyway than by sitting by a loud street with cars driving by. Next time I am in Paris I will be coming back to visit this place. He as well offers dessert, sandwiches, drinks, etc to grab and go with. Just drop by. Tell him crazy red pant flirting American sent you. He won't remember me. Just might make him laugh.",
  "Excellent crepe and the owner has an amazing personality! Highly recommend this little Caffé!!!",
  "Very friendly operators, made you feel welcome and right at home. Excellent food. Specializes in crêpes. We had a off menu selection he prepared. Crepes, cheese, egg and seasoned chicken. Very good! Very filling, really is a dinner dish. They also have sweet and dessert crepes. Also sandwiches etc.",
  "We were looking for crepes and this place hit the spot. Kishin (the owner) was super welcoming and made us a fantastic crepe, imbued with his passion for art.",
  "I'm usually all about food quality and don't give much weight to service but this gentleman just changed my worldview. BEST SERVICE EVER! And of course the food is great. My wife and I ate sandwiches and crepes and they were delicious! You gotta stop by this joint. Very good food and very good prices. I will come by every time I'm in town! Mercy, Happy Caffé! See you soon...",
  "Hi Christian !!!\nMerci to you !!!!\n\nTake care\nHappy team",
  "Crepes were amazing! I got Nutella and banana and it was super crispy and not soggy. Service was awesome! Best employees that make you smile and great customer service. 10/10",
  "Excellent food. Excellent location. Excellent French onion soup! Enjoyed the snails! Our waiter too time to get to know us personally and was welcoming !\nRelaxed atmosphere. Highly recommend!",
  "So fun and good food! Very good service. We stopped by just for a quick bite and I'm glad we came here.",
  "Very friendly staff. Good sandwich and coffee. Gave me a free pastry out the door. I would highly recommend this business.",
  "Wonderful little shop with great food and an entertaining staff. We had the ham and cheese crepe and a tasty hot chocolate.",
  "Hi Hazen !!!!\nMany many thanks for your lovely review.\nTake care\nHappy team",
  "I loved this restaurant!! The crepes were to die for and the lattes were delicious. Perfect ambiance and perfect way to start the day!",
  "Great service, location, food, and fun time with the owner (spider-man). Would highly recommend.",
  "Truly a one-man show. This guy was so generous and sweet and the crepes were amazing!!! You can tell he puts a lot of care into making everything. The OJ was also incredible!",
  "Hi Kyra !!!!\n\n\nYou are the BEST !!!\n\nTake care\nHappy team",
  "This little snack shop has the friendliest shop keeper! I always visit him when in town and this is my 3rd year. I've had the savory ham and cheese crepe - I'm no expert but it's tasty and perfect for a quick bite. I also enjoy their croissants and donuts too. They have a small selection of other assorted pastries and pre-made sandwiches. Ice Cream novelties and alcoholic and non-alcoholic beverages can also be purchased.\nGo give this guy your business, he's super friendly and speaks great English, French and probably a few other languages. They also take credit cards.",
  "After a full day of sight-seeing, we needed a quick dinner, so we looked online for suggestions. Happy Cafe had 5 stars, we tried it and it was awesome. Highly recommend the ham & cheese crepe and the chicken kabob crepe. Both are excellent. Highly recommend for great food and friendly service.",
  "Hi Angela !\nWe remember you well because of your positive energy….thanks for your lovely words\n\nTake care\nHappy team",
  "Found this place online and decided to try it. It was so good and Tom was so funny. I will definitely be going back the next time I'm in Paris. The food was great and the service was amazing! 10/10",
  "Hi Leslie !!!!\nYou definitely made our day !!!!\nMany many thanks !\n\nTake care\nHappy team",
  "We stopped here on our walk to the Louvre to grab breakfast. Excellent crepes, friendly service, the people serving us spoke French, Spanish, and English. Prices very reasonable.",
  "We love this place, came here more than once during a 6 day stay in Paris. The owner and crepe maker were funny, delightful and very very friendly. Crepes were fantastic. My some had 2 crepes in one meal ( he is a teenager!). Even my daughter who does n like crepe lived the ham and cheese. Highly recommended!",
  "Burnt croissant but still really good surprisingly. very friendly staff and good quality",
  "Hi London !!!!\nVery happy by your lovely review !!!!\nWe enjoyed to serve you !!!!\nOur croissants are very high quality full of the best French butter. Next time it will not be burn. Sometimes when the weather is very cold, we warm them up….\n\nTake care\nHappy team",
  "amazing food for a great price. all sandwhich around 8-9 euros and are a decent size. there are no vegetarian options though!! i got the tuna sandwhich which was delicious. all staff was incredibly friendly and food came out very fast. there is seating inside and outside, however it is a very busy area.",
  "Really good crepes! I ordered the Nutella and coconut crepe and it was amazing. They made it fresh right there. Service was amazing as well.",
  "Hi Maggie !!!!\nIt was a great pleasure to make you happy !!!\n\nTake care\nHappy team",
  "My last trip to Paris was 4 yrs ago and I recalled stopping at the Happy Caffe and being so impressed with their joyful and attentive service. So I stopped in again today. I think they are even nicer now than before. They made a delicious ham and cheese crepe. Looking forward to stopping in again before I leave.",
  "Hi Cody !!!\nYou are now a platinum member !!!!\n\nTake care\nHappy team",
  "It was a fun place to go. Very nice people and friendly. I had the ham and egg crepe, my wife had the strawberry and my son had donuts and Nutella crêpe.",
  "First, the tragedy: the crepes were unavailable when we came. This was terrible, because literally everything else about this place was a delight. The sandwiches were great, the coffee was great, the pastries were great, the location was great, and the staff were outstanding and hilarious. We stopped here on our way out of town and are literally furious it wasn't something we did on day 1. It's making me hungry just thinking about it again. My son, who doesn't usually care about yelp, loudly declared when we left \"Dad, make sure you give this place 5 stars!\". He's never said that about any other place.",
  "Great place. The servers are very welcoming and make your visit enjoyable. We had strawberry, banana Nutella crepe which was very good. I had the Kebab with cheese crepe which was awesome. Definitely a place to visit if you are in the area.",
  "Delicious crepes, and good variety. I had the Nutella with strawberries and bananas. Outdoor seating and charming wait staff!",
  "Where do I start... this place was awesome! My husband found this after a long morning at the Louvre and we wanted to get something quick. The food was great, but Christian \"alias Tom Cruise\", as he says, and his friend was even better... so friendly, engaging and welcoming! It didn't hurt that he complimented me on my French too!! This place lives up to its name indeed. I even went back to say hi one last time. He knows how to do business because it's not just the great food, great service, but the great relationships he builds that keep people coming back. He knows the special ingredient to a \"happy cafe\" indeed! Thank you for the wonderful experience! If I ever come back, I'm holding you hiring me because you said my French was really good!!! Thank you for the encouragement as I don't speak if that much. In the meantime, I'll keep working on my French so I can be a worthy hire in the future! Thank you!",
  "We had just finished a 6 hour grueling tour of the louvre and were just the slightest bit hangry and ready to crawl out of the museum so we searched for cheap eats around this otherwise expensive area and came upon Happy Caffe. JUST what the doctor ordered. Full of filling sandwiches, DELICIOUS pastries (try the jelly donut bites and the almond croissant..heavenly!) and an assortment of drinks. The owner/shopkeeper is a jovial jokester who makes you feel right at home even if you don't speak French. PS he is fluent in English. Do yourself and your wallet a favor and stop by here for a yummy picnic to take to the gardens nearby.",
  "By far, the best and affordable crepes near the Tulleries metro stop. We had both savory and sweet crepes and both were delicious. I chose the chicken and cheese and it was very good. Crispy burnt cheese and crepe on top, with a generous amount of filling throughout. This is a definitely a grab and go place, but you have a perfect sitting area in the park across the street. The owner is very nice, funny, and is an artisan of crepe making ...definitely worth the short wait for delicious and reasonably priced crepes! Highly recommend.",
  "Excellent crepes. Most a takeaway place and you can just go the Tuillares garden.\nPersonally not a fan of crepes, but this was super to eat .\nThe two guys at the counter were also outgoing and funny. Good combination",
  "I didnt want to come here at first because of the American name.... Im in France. BUT the chicken egg and cheese crepe was the best crepe I have ever had. The workers were extremely friendly and helpful. It is really a 10 out of 10. Also, the hot chocolate comes with the froth designs. First I have ever had that since I don't drink coffee. Soo, sooo good.",
  "What a fun place to eat. Even though there are no tables and chairs, SO worth to come to this place. You could order some food and eat while on a walk or while sitting on a nearby bench.\n\nThe crepes were DELICIOUS! Not to mention, the service while making the crepes was fantastic. I would totally come back here again.",
  "Visit this place for the crepes, visit again for the entertainment value. The shop itself is a good little convenience store, but the guy who made our order was high energy, funny, welcoming, and wonderful. He claimed to be Peter Parker (aka Spider-Man) but based on the other reviews, his name is probably Christian.\nThe crepes are amazing, and we returned the same day because they're just that super.",
  "Happy Caffé has Excellent food and service. They are very happy and made lunch fun for the kids. The crepes were the best we had in Paris.",
  "This place is awesome, the kabab chicken is wonderful and the man working who goes by \"Tom Cruise\" was hilarious and gave us great service after we learned he has been working there for 12 years. We really enjoyed the food. I would definitely recommend coming here if you are a tourist looking for a quick bite to eat for a sandwich or dessert!",
  "Quintessential French crepes. My son ordered two! Great, friendly owner and fast service!",
  "Wonderful crepes with a side of comedy. We loved this place. There are some seats outside and very convenient to The Louvre.",
  "Hi Sarah K. !!!\nMany many thanks for your lovely review !!!!\nTake care\nHappy team",
  "We happened upon the shop on a recommendation and were so happy that we did! What a nice person running the shop. No wonder they call it the happy cafe. He made fresh crepes right there and matched us with sandwiches. We had the 'Oh my God' sandwich, which was chicken cheese potatoes and sauce in a delicious half roll. It was home made and out of this world. The owner really makes you feel welcome. The prices are the best we found in the are too. Highly recommended",
  "First night in Paris with my 12 year old and this guy made our day! He immediately stared laughing and joking with us and kept telling all the other customers that my daughter was his \"best friend\". She of course turned bright red and couldn't stop laughing. Crepes were great and \"Peter Parker\" was so funny.",
  "Wow, amazing crepes. Had the chicken and cheese, hubby had the ham and cheese. All amazing and huge. You can definitely share unless you are famished. We then had Nutella and strawberry and my husband had the Nutella's and banana. These were all spectacular. Highly recommend and \"Spider-Man\" was really fun to talk with and kept us entertained while we waited. There is a wait because it's all made to order, but worth it! Don't miss this stop!",
  "Stop in and ask for Christian! If your lucky....He will be there to greet you with a big smile and warm welcome. He will offer to fix you up with a \"magical\" espresso or a little something to go while making you laugh. Crepes are a must have!!!Because of Christian....The Happy Caffé became a daily routine stop during our unforgettable time in Paris.",
  "Great place for a quick pastry or crepe. They understand English so that's always a good thing for non-French speakers. They also have a variety of drinks, coffee and sandwiches. They're conveniently located off of the Tulieries metro stop.",
  "This place is great! It's small and you might miss it but it's worth finding. We had the jambon et fromage crepes. They were huge and delicious and had soo much cheese. We also got a bottle of rose which the owner uncorked and gave us two cups! It was great to get a crepe and go to the park afterwards. The owner is super friendly and he has regulars. He designed a cute design on our crepes before closing them up. The crepes were inexpensive as well! Well worth it! Check it out!",
  "if you are seeing this please take my word, i am for some reason the one low star review and it is because the crepes aren't good. you can make them at home, literally €11 euros for a crepe with cheese or nutella, please please please just go somewhere else with actually good french crepes i am begging you. all the people who left these reviews are tourists who i don't think have actually ever had a actual FRENCH crepe. this is the stuff you can get in the US, the staff were nice but it didn't make up for the awful crepes!!!",
  "Hi Maeve !!!\nVery happy that you came to have our fresh homemade organic products, cause they are !!!!\nI am sure that you made a mistake, our cheese or Nutella crepe ARE NOT at 11€ !!!! So when you write a review try to give the truth. We are very sorry that your experience was wrong, and it’s depend what you are waiting for ? Only to let you know not so many others places use the same level of quality that we have. But this is another story, prices prices….we don’t sell prices, we sell quality.\n\nTake care\nHappy team",
  "This shop owner defines the personal touch. He spreads his joy right when you walk in and goes out of his way to make the simple experience of grabbing a bite to eat memorable. The shop itself is small but has plenty of delicious treats and snacks. We went for crepes (one sweet and one savory) and then went back for more. There aren't many places that are able to gain my loyalty from one visit on a trip abroad, but this is one of them. Every time I visit Paris I'll make a point to go to Happy Caffe.",
  "A wonderful little café. The owner was so friendly and gave us many great suggestions. I will definitely go back. A refreshing dose of happiness. We had a ham and cheese crêpe and a bacon salad. Both were delicious topped by perfect café au lait. The owner did everything possible to make our little visit enjoyable. Overlooking the park you really couldn't ask for anything more on a spring day in Paris. Thank you Tom! Recommend!",
  "Lovely owner, kind and funny ! Makes delicious crepes. Inexpensive and fresh. We had tomato cheese - he sliced the tomato freshly.",
  "Friendly. Knows English. Great crepes! I would definitely recommend. Be sure have him write on your crape and take a pic.",
  "As everyone knows, this guy is Spider-Man. He chatted us up the whole time we were there playing jokes telling funny stories and speaking to customers in different languages. We had to wait for 3 people in front of us but it was well worth it with entertainment. He had my son laughing and telling everyone that he was his best friend. He finally gave him an apple pie for free and told him he was not to share it with his dad. I had a chicken and cheese crepe the first day, then came back for a ham and cheese the next. The caramel doughnuts were awesome. Great little spot that wasn't expensive to grab on the go or while we stayed at the Westin down the street.",
  "The man who works here is amazing. He is the nicest and friendliest person I have met in France. Very memorable. He boosted my mood instantly. Crepe was good and fresh, too!",
  "Excellent! A fun and friendly staff, plus excellent service and food made our dining experience outstanding.",
  "Hi Dave !!!!\nWe do all for YOU it’s our pleasure !!!\n\nTake care\nHappy team",
  "Very friendly service. They specialize in crepes. The croisssants are nice. Good value hwrr",
  "Me and my wife went in really early around 7:30am. The only place open. The guys was really friendly. He didn't like how the crepe looked and he made us another one before giving it to us. They sell soft drinks, wine, some liquor. Wine and liquor bottle to go. This place is open early and closes late. Amazing!! Definitely 5 stars.",
  "The most amazing service I've ever received! Croissants and donuts were out of this world."
]