[
  {
    "text": "Reply for the comment on 24/12/2025 to Natalia Dear sir/ madam. I would prefer to appeal to the facts but not words. You said you took care and paid attention to the situation - but you didn’t reach me as well on my email you reply that you can’t help. You said it’s non-discriminative desicion. - I explained the situation, that the refusal was made solely on the nationality, as I go along with all the formal criteria - I’m an official resident, I have work and address. I also have my Finnish bank account and reliables French garants as well. I would like you to state officially on which bases you made this decision. You said you are sorry that I’m not happy with the decision- being Russian sometimes I face personal cases of dislike. Here you accepted that it’s not a personal decision, but the politic of the company. I thank you for wishing me luck with another company ! I was recruited by French company as highly qualified researcher and now facing this issue, my future in France is becoming fragile. It is a sad fact, as being in other EU countries I never got refused of basic rights just by nationality.",
    "rating": null,
    "sentiment_label": "Refusal based on Russian nationality"
  },
  {
    "text": "This company looked after my investment portfolio when I really needed some e pert help. Jean was super helpful",
    "rating": null,
    "sentiment_label": "This company looked after my investment…"
  },
  {
    "text": "I have been a loyal customer of BNP Banque for the past 7 years and I hold a permanent job with a stable income. Despite my long relationship with the bank and my clear ability to repay, BNP Banque has never offered me any credit or financial assistance. The way my requests were handled was unclear and felt disrespectful, with no proper explanation given. I do not recommend BNP Banque—don’t go for BNP and don’t waste your time. They will not support you in your financial needs, even when you are eligible, reliable, and fully capable of repayment.\nAnd Without my considération and Without informing me they have cancelled my appointments which is really careless and reckless behavior I experienced from banque staff.",
    "rating": null,
    "sentiment_label": "27 rue Royale, 74000 Annecy. Worst service's"
  },
  {
    "text": "Very bad experience with this bank they have no respect at all for their customers even the loyal ones.",
    "rating": null,
    "sentiment_label": "Very bad experience with this bank they…"
  },
  {
    "text": "If you are an American, especially an American student please do NOT waste your time or money investing into this bank. This bank is the biggest scam I’ve ever seen in my entire life. Specifically this branch, it is the worst. I signed up with his bank through my school, and it seemed like from day one I had nothing but the worst experience. First of all, they kept giving me the wrong code to activate my account, so I was never able to access my student loans, which made me late for rent payments in both America and in France. They also kept giving me excuses and the runaround so it got to the point where I said that I didn’t even wanna keep my student loans in this bank anymore and I just wanted to wire transfer everything to my American bank account. I tried to do the wire transfer, but the most incompetent woman I’ve ever met in my entire life, somehow was unable to write down the proper information for a wire transfer, so then she has the audacity to email me, ironically two minutes before the bank closes, and say that she got the information wrong and proceeded to ask me to send her a screenshot of my AMERICAN bank account information so she can “do the wire transfer.” Obviously, I was extremely upset because any person with a brain knows that you never do something like that, and I even called my bank in America to verify if what I thought about this being illegal and suspicious activity, they confirmed that it is suspicious and they even asked me if I was talking to a real bank teller because they said that NO bank teller that actually knows what they are doing would ever ask me to do such a thing. It got to the point where I had to report them to the embassy, as well as the school that I was attending, because they refused to hold the bank accountable for it’s actions. I wanted to close my account with the bank, but my school told me that I needed to have a French bank account open to keep my Visa, and I believed that lie, so I kept the bank account open for a few more months, but of course they gave me nothing but pure hell. In the beginning, they told me that there would be no fees for me because I’m a student and OF COURSE they lied and there WERE service fees, I also realized that they charge me higher service fees than they did some of the other students. My service fees were €10 other people had €8 and other people had €0… how are we getting different service fees when we all go to the same school and opened the exact same type of bank account at the exact same time??? They also would tell me whatever they felt like telling me, one day she said that I can only withdraw €20 minimum from the ATM but then I come back a few days later and she told me that I actually can withdraw €10 from the ATM. They also made it impossible for me to get my account to zero when I wanted to close it, it’s almost as if I had to sneak and get my account to zero because if they saw me wanting to withdraw all my money, they asked me “ Are you trying to close your bank account?” “ do you need to get to a zero balance?” Why do you care BNP??? What do you want me to do, go into debt with you or something? Most PROFESSIONAL banks don’t care if somebody wants to get their account to zero or close with them, if they actually have money then they’re not going to hold people’s money hostage. I can go on and on and on about the bs that this bank put me through. I almost want to sue them (alongside my school that enabled this bank’s unprofessionalism) for fraud and emotional distress. I did report them to the (redacted) and (redacted). Perhaps I’m just one report but I’m 1000% going to let every American student know that if they’ve had the same problem with his bank please do not be afraid to report them to the (redacted) as well. The USA needs to know that these people are playing with their FEDERAL money.\n\nUPDATE: they made me remove the name of the lady who completely screwed me over and almost drove me up the wall mentally. No matter, I can delete her name, but it still doesn’t erase the fact that this bank is horrible, and that NOBODY should never engage with any of its employees or anybody associated with this waste of wood. Also, I know that they are reading this review, it doesn’t matter if I erase her name from this review, I already sent her THIS BANK AND HER FULL NAME to the (redacted), when I reported the bank to them…so the people reading this review might not know her name, but TRUST ME, the (redacted) knows her name and that’s the ONLY people/federation who needs to know :-)\nEDIT 2: once again this bank is showing how completely incompetent and narcissistic they are. They are trying to say that I acted out with one of their employees. YES that tends to happen when people are STEALING from you & lying. Also ONE argument out of 100 other respectful encounters, doesn’t make me a bad customer, it only proves that YOU’RE a bad business. LYING SCAMMERS.",
    "rating": null,
    "sentiment_label": "If you are an American…RUN"
  },
  {
    "text": "Worst bank franchise in the whole world. Go for smaller banks if you want to exlerience crystal clear service.",
    "rating": null,
    "sentiment_label": "Worst bank franchise in the whole…"
  },
  {
    "text": "customer service horrific worse than HMRC",
    "rating": null,
    "sentiment_label": "customer service horrific worse than…"
  },
  {
    "text": "To me it is mind-blowing that such a large bank does not have ONE customer service representative who speaks English. I have just called to sort out a problem with my bank account in Paris, and I was told \"il faut parler français\". It is just unbelievable. I had to hang up.",
    "rating": null,
    "sentiment_label": "Not a single English speaker at customer service"
  },
  {
    "text": "Worst bank and customer service ever.\nAsking a client (after 40 years) to shut down his account to allow a transfer is unbelieavable.\nApp and online messagerie are from middle age too. Never worked properly.\nMerci et adieu 👎",
    "rating": null,
    "sentiment_label": "Worst bank and customer service ever."
  },
  {
    "text": "Worst bank I have encountered ever. Extremely poor services, not transparent, incompetent.",
    "rating": null,
    "sentiment_label": "Worst bank I have encountered ever"
  },
  {
    "text": "Have the unfortunate experience of having to use this company to pay for a telecoms service. So far have filled out 3no Direct Debit agreements, the first one they messed up the account number, the second one they didn't process and wanted to charge me for none collection an extortionate amount. Queried and complained about this and I'm still waiting a response nearly a month later. There agreements are not clear and you would assume that when the agreement shows an initial payment and further payments boxes that the initial payment would include the administration fee, it doesn't. They add things when it suits and pass the buck to the various other companies they use for their services. Will be refeering all of the experience to a legal team and the financial ombudsman.\nUse these at your peril, the whole situation is completely untenable. If you are considering using this company, I stongly suggest that you don't.",
    "rating": null,
    "sentiment_label": "Have the unfortunate experience of using this company"
  },
  {
    "text": "What an incompetent unfriendly company!\nYou call and are immediately stuck in some queue without any sign of speaking to anyone. I was No.1 in queue and after 16 minutes went to No.2 - UNBELIVEABLE!! Still waiting and 33 minutes in!!!\nIf you are taking out a lease deal I'd check to see if BNP Paribas are the funders and if \"Yes\" I'd tell them to move to an alternative provider",
    "rating": null,
    "sentiment_label": "What an incompetent unfriendly company!"
  },
  {
    "text": "Worst bank!! avoid if you can! Costumer service is incredibly rude and makes everything your fault, even its their. Cards are not working properly, I already have my 5th card and I am client since a few months. It also took them 3 weeks to send me the new card, when I went to complain they said it will arrive but couldnt provide any assuring words. It takes ages until the charges show up in your account, sometimes even take 3 weeks. Super rude with you if you don’t speak french, only french people answer on english line. They will not explain you any procedures of your card or how to activate it! If you use the 'send a message costumer service' option in their bank, they will just answer with come to the banks office. Absolutely unprofessional. AVOID AVOID AVOID!!!!!",
    "rating": null,
    "sentiment_label": "Worst bank! AVOID!!"
  },
  {
    "text": "absolute trashy bank. don't use their services!",
    "rating": null,
    "sentiment_label": "absolute trashy bank"
  },
  {
    "text": "I went to open an account.\nI am European and didn’t have a appartment in my name yet. When I went to open my account after all the correct documents, they told me to leave and can’t open the account because “there was something wrong with the profile of my Hebergeur” and to come back when I have my own appartment ??? They didn’t even call back to explain why.",
    "rating": null,
    "sentiment_label": "I went to open an account."
  },
  {
    "text": "Bullies\nThis company we have an ongoing court case with .They have bullied us into the ground in court spending far more than the payouts given to us and also have ignored court orders to pay money to us .\nDisgraceful company !",
    "rating": null,
    "sentiment_label": "Bullies"
  },
  {
    "text": "Awful bank, they wrote my address wrong for my card, didn't know how to deliver another one, wrote my home address wrong. Closed my account for now reason.",
    "rating": null,
    "sentiment_label": "Awful bank"
  },
  {
    "text": "If I could give 0 stars I would. This has been the most complicated lengthy and frustrating process. Bnp Paribas has terrible communication skills, is disorganized and does not value their clients time or business. If you can save yourself the trouble do not come here I am STILL having trouble with my bank account and card even though I started the process of opening an account in MAY. Terrible bank I don’t know how they are still in business or are considered one of the biggest banks of france. Never again",
    "rating": null,
    "sentiment_label": "If I could give 0 stars I would"
  },
  {
    "text": "This a company that encourages incompetence by lack of accountability. The deadline given was not respected.",
    "rating": null,
    "sentiment_label": "Incompetence is the norm…"
  },
  {
    "text": "Firstly, the positives are that all of the services I require have been provided. I believe my money is safe and the customer service in person at the branch has been good (although warning for expats it's entirely in French).\n\nHowever I have found them generally old fashioned and difficult to use and I would strongly recommend choosing a different bank if you can. The website frequently doesn't work, and I tried to set my account up online before arriving in France, and this also didn't work at all so I had to do it in person. They try to upsell you on a large amount of features which makes the process very drawn out.\n\nWhen using the bank, transactions are very slow - money takes a long time to be sent, and card purchases take a very long time to show up, and have unhelpful labels, which makes budgeting difficult. The app and website are poorly designed. Most frustratingly, when I try to make payments online, several beneficiaries have been refused for no apparent reason - including setting up a direct debit to EDF! This has been quite disruptive. The 24 hour wait time to pay someone new is also frustrating.\n\nThe service is far to poor to be worth the steep fees that they charge. I would recommend going somewhere else.",
    "rating": null,
    "sentiment_label": "Difficult user experience"
  },
  {
    "text": "If I could, I would rate it negative.\nEver since I opened the account with them, they never met their promise, not account sharing, not free card, but instead they kept charging. Then they are rude everytime you talk to them. I've been to BNP to three different cities and they were the worst. They don't honor their part and blame it all on you, we tried for housing loan and they just found one reason or other to refuse the process.",
    "rating": null,
    "sentiment_label": "Negative star"
  },
  {
    "text": "The BNP is certainly the most difficult bank to deal with.\n\nSince opening the account it's been a bit of a hassle, but now I'm trying to close the account and it's been a nightmare.\n\nNo wonder traditional banks are losing market share to virtual banks. It's a lot of unnecessary bureaucracy.\n\nRequest to close my account:\nThe BNP asked me to send my request to close the account by secure message, inside my account on the website (which is presumably really ME as I'm inside the account), which I did...\n\nThen they asked me to send THE SAME request, by dated and signed letter. OK, it cost me time and money as I don't live in France any more, international postage, I did it. =/\n\nThen I was asked AGAIN, to send THE SAME request, by secure message, via my account on the website, and I did it again.\n\nNow, to my surprise, a FOURTH request with a MANUSCRIPT letter sent AGAIN via the website.\n\nIt's unbelievable.\nI'm trying to be patient, but it's getting difficult. Zero patience.\n\nOn top of all this delay and waiting, the monthly fee is still being debited from my account.\n\nI'm warning potential new customers to look out before choosing this bank.\n\nFrom now on, I will use every means and opportunity to warn customers and advise them never to choose this bank.",
    "rating": null,
    "sentiment_label": "Nightmare to close the account."
  },
  {
    "text": "pas mail mais application qui plante etc etc tres penalisant car impossible de faire des virements etc ca tourne dans le vide",
    "rating": null,
    "sentiment_label": "pas mail mais application qui plante…"
  },
  {
    "text": "Worst bank in France lot of stealing",
    "rating": null,
    "sentiment_label": "Bad bad"
  },
  {
    "text": "I have delt with BNP Paribas in 2 separate ocation on profit sharing from my company, in both situations this bank has been a complete failure of a bank.\n\nFirst time they created two accounts for me, gave me the password and username of the empty one and put the money on the other one, it took more than a month to get it solved, having BNP refused to assist me several time saying it was not their problem....\n\nThe second time i did the withdrawal of my capital and it has taken more than a month to process.",
    "rating": null,
    "sentiment_label": "I have delt with BNP Paribas in 2…"
  },
  {
    "text": "I have to use their service to use PlanetShare unfortunately.\n\nI have been using this for about 7 years.\n\nThe service has always been terrible, and the only way to contact them is to fill a form that has so many mandatory fields you will eventually give up.",
    "rating": null,
    "sentiment_label": "Avoid if you can."
  },
  {
    "text": "The worst customer service you can have from any bank sand any branches. The director refuses a customer to access an account despite valid ID, proof of account with his name and a 40 years old account own by his mother. The director shouted at the customer asking for a passport just to modify an address error on his account. Also the clerk at the bank never ever answer emails sent to them, when ask why, they respond that they are not a \"chat\". Basically you give them your money but then you are trap in the system where you have to beg to get it back, change any info and you are treated like less than nothing. The client took his 150,000 euros and moved to the Societe Generale. Bank in France are horrible to deal with in general but this one take the cake. The director is a scum.\nVisited in April",
    "rating": null,
    "sentiment_label": "The worst customer service you can have…"
  },
  {
    "text": "Some of the kindest bankers I have ever met. Thank you so very much",
    "rating": null,
    "sentiment_label": "Some of the kindest bankers I have ever…"
  },
  {
    "text": "I've been 4 years now with BNP PARISBAS and I never had any issue so far .. Customer service is good and people are very helpful (at least on my agency in Argenteuil Gare).",
    "rating": null,
    "sentiment_label": "Good customer service"
  },
  {
    "text": "Terrible and rude customer service\nAfter they made a mistake with my details in the contract, it took weeks of telephone calls (not picked up - just dropped) to reach someone. Then when I was trying to explain the mistake the man spoke over me and denied it and I was told to 'stop talking'.\nWe cancelled the contract. Imagine if you ever had to make a claim. No chance.",
    "rating": null,
    "sentiment_label": "Terrible and rude customer service"
  },
  {
    "text": "I do not suggest this bank or the CITE UNIVERSITAIRE location. There is high staff turnover, and a lot of disinformation/misinformation is spread. If you live at a distance, you will have a difficult time reaching someone by email or by phone. Some of my recent problems: charges on my account. staff cannot explain charges. staff do not respond to emails. staff do not arrange phone calls. staff gets hostile quickly. I have been trying to cancel my account for two months, but part of the problem is that the team doesn't want it. Perhaps BNP enjoys getting extra bucks with monthly charges? All I want is to leave BNP for good, espeically now that I have left France and no longer use it. How can I cancel account, and get a refund for all of these charges for a service I no longer use?",
    "rating": null,
    "sentiment_label": "CITE UNIVERSITAIRE: How to Cancel Your Bank Account"
  },
  {
    "text": "Bnp paribas bank paris france is the worst bank ever Michael janas who says he is the president of court (which I don't think is) the bnp already scammed me money but say they will give me it back if I again give them more money no way definitely scammers please beware everyone they are all scammers and will leave you bone dry.",
    "rating": null,
    "sentiment_label": "Bnp paribas bank paris france is the…"
  },
  {
    "text": "I had a very horrible experience at the Metz France branch of BNP Paribas! Please spare yourself the mental agony and racism and go to a different bank!",
    "rating": null,
    "sentiment_label": "Horrible Service"
  },
  {
    "text": "Terrible administration process , opened an account and after 2 months still no sign of my card. Had to go in 6 times to sort it and then they sent me the wrong PIN code. Staff helpful in La Confluence branch but that’s the only positive. Wouldn’t recommend",
    "rating": null,
    "sentiment_label": "Terrible administration process"
  },
  {
    "text": "Wowwwwww!!!! I dearly hope that people read these comments before even THINKING about using this company. They are absolutely hopeless!!!!!!!!!!!!!! If you are not cut off, you are on hold for aggeeeeesss to no avail. Emails go unanswered. Trying to get access to your agreement is like searching for the Holy Grail. Useless, useless, useless!!",
    "rating": null,
    "sentiment_label": "USELESS, USELESS, USELESS"
  },
  {
    "text": "200 years ago this company might have been able to call themselves a bank. Certainly not in 2023. What went wrong you ask? The better question is what went right - and the answer is almost nothing.\n1. They couldn't work out what forms we needed to sign (3 trips to the bank)\n2. They couldn't send the bank cards when ordered (3 months delay)\n3. They don't process inbound transactions for 2 days.\n4. It takes 4 days to send an outbound transfer\n5. They block your card if they've not processed the funds\n6. There are no useable instructions to unblock a card from mobile (only on PC)\n7. There is no way to increase your withdrawal limit (to overcome a mistake they made in account creation\n8. There is no instant messaging or replies to Urgencies using any of their communication methods.\n\nIn the time it took to look for non-existent card unblocking functions I setup an account with another bank.\n\nBNP Paribas is not a bank - its a jail for your money.",
    "rating": null,
    "sentiment_label": "200 years ago this company might have…"
  },
  {
    "text": "I have never had such a bad customer service or banking experience. My total time as a customer lasted 5 weeks. Let me go summarise the story for you.\nTwo weeks after opening the account on a Thursday while abroad my card and online banking access is suddenly locked after trying to do a small payment, for 2 days I try to contact someone at the bank with multiple numbers I am given over the calls to their various numbers. When I actually manage to reach someone at the bank without the call dropping after 20 minutes of bad elevator music no one knows anything.\nThey leave 'Emergency' messages to someone who can help and should call back within 72 hours, what a great emergency response, if only this were even true. On Tuesday after calling multiple times again I manage to get someone to open access to my online banking, he explained my card was revoked the week before (that I cancelled it?) he is not sure, but it definitely cannot be reactivated. They can only send a new one within the French territory. At this point I'm already a bit shocked by the whole response, what if I only had this card, this account and since 5 days no one in this bank has cared for a second that their customer has been left without access to his balance.\nWith the online banking access reestablished my first thought is to transfer most of my money out, this is when I realise that although the online banking access is back the transfers page is locked, it tells me to call the bank... great.\nOver the next week, with no luck reaching anyone by phone who can explain anything and having left multiple messages in the bank contact form, I decide to start officially closing the account sending dated and signed letters in case further moderation is needed. To make the rest of the story shorter the following events ensued. My direct debits are all rejected although I sent a letter to ensure they would go through (someone says I rejected the payments? they seems confused, someone will check...) My account closing is programmed for December, in 3 months when legally it should take 30 days max. Transfers stay locked for the next week and until the closing of the account. I send official documents with the legal obligations that the bank has failed in, with this 24 hours later they finally comply and transfer my balance -3.50 Euro that they keep as a transfer fee for the SEPA payment to my other national account, a real bunch of thieves considering the last 3 weeks service they provided. I'm just happy to be out.\nHighly recommend you avoid this bank.",
    "rating": null,
    "sentiment_label": "My 5 weeks as a customer of BNP Paribas"
  },
  {
    "text": "Joke of a company... incompetent doesn't come close",
    "rating": null,
    "sentiment_label": "Joke of a company.."
  },
  {
    "text": "I closed my bank account and then the insurance was still not canceled. Until the summer when I was on vacation, they asked me to pay the punishment fee by sending mail without calling or email which they had. Because I had not seen it for two months, I needed to pay 76 euros for nothing.\nI hate them and I will never put my money in this company in my life.",
    "rating": null,
    "sentiment_label": "I closed my bank account and then the…"
  },
  {
    "text": "I have been costomer to the this bank since 7 years, the services are very bad at a high prices. Bank managers do not know their jobs as well other employees.",
    "rating": null,
    "sentiment_label": "The worst bank ever"
  },
  {
    "text": "BNP Paribas is the worst bank I have ever had. Any response to my real estate credit request. Could not stop my account after two months of attempts and requests made both by letter and email that App. Customer service and advisors were bouncing off bad information and wasting my time and money. Money that I have been needlessly charged!\n\nI strongly advise against this bank!",
    "rating": null,
    "sentiment_label": "BNP Paribas is the worst bank I have…"
  },
  {
    "text": "I want to thank Delphine DESMARETZ for being attentive and helpful in guiding us to open an account. I recommend this bank for the fast service.",
    "rating": null,
    "sentiment_label": "Opening an account"
  },
  {
    "text": "",
    "rating": null,
    "sentiment_label": "talents certains a la bnp antony mounie"
  },
  {
    "text": "Terrible nothing works, staff is arrogant and disrespectful. Really bad banking experience I really need to move",
    "rating": null,
    "sentiment_label": "Terrible nothing works"
  },
  {
    "text": "Impossible to access anything. All the codes I'm supposed to receive don't arrive by mail and in the case of SMS I get them in batch a couple of hours after the request. Worst online banking experience.",
    "rating": null,
    "sentiment_label": "Horrible"
  },
  {
    "text": "After more than 15 years of being a client with BNP Paribas Belgium, I found them to be incompetent partners in financial services. My account was terminated by the bank citing a clause allowing either party to terminate the agreement within 3 months without providing a reason. Despite having insurance with them, which was sold to me as a full package with excellent coverage, it did not cover the cost of damaged items during an attack on me while in public transport. I personally requested access to the security cameras footage from the transport provider, which clearly showed the attacker, but the bank's affiliated company, AG Insurance, refused to provide any compensation as they couldn't identify anyone to blame for the damage. I do not recommend anyone to have insurance or accounts with BNP Paribas Belgium.",
    "rating": null,
    "sentiment_label": "Disappointing experience with banking and insurance services"
  },
  {
    "text": "Informed of wrong settlement figure, showing small amount on agreement that shouldnt be there, complaints dept wont look at it for upto 8 weeks, buyer constantly hounding to clear outstadning amount, even though I had been told by BNP is was. Absolutely shocking service - NEVER USE !!!",
    "rating": null,
    "sentiment_label": "Informed of wrong settlement figure"
  },
  {
    "text": "Attentive service, very helpful. Highly recommended.",
    "rating": null,
    "sentiment_label": "Attentive service"
  },
  {
    "text": "Worst customer service of all time. I wanted to transfer my shares into a different account. They sent me a form that was partly pre-filled. When I handed it in, they told me that the information in the pre-filled section of the form was wrong and my request therefore null and void. They asked me to hand in a correctly filled form, which is impossible because I only ever got the pre-filled version.\nMy emails have been ignored for a month now.",
    "rating": null,
    "sentiment_label": "Worst customer service of all time"
  },
  {
    "text": "",
    "rating": null,
    "sentiment_label": "Suck these nuts!"
  },
  {
    "text": "Never keep your money in this bank. Be careful. Because their mobile banking server always down. If you have emergency situation, they only apologise.",
    "rating": null,
    "sentiment_label": "Never keep your money in this bank"
  },
  {
    "text": "App and services not available most of the time. Trying to do anything with this bank is a month long hassle and there's nobody to talk to. I don't have access to my own money.",
    "rating": null,
    "sentiment_label": "Unavailable services and zero customer service"
  },
  {
    "text": "I want to give a 0 rating to this annoying bank, I have been Paribas' client for the last 4 years and it showed be hell in terms of international transactions, and always had issues using the debit card. I highly recommend not being a client for this bank.",
    "rating": null,
    "sentiment_label": "Horrible Experience"
  },
  {
    "text": "Frankly this bank still does the job. It given me good annual returns.\nLa Banque postale is to avoid at all costs.",
    "rating": null,
    "sentiment_label": "Frankly this bank still does the job"
  },
  {
    "text": "Don't open an account with BNP Paribas because they hide an insurance subscription in the fineprint and then charge you every month, takes insanely long for international transfers (5 days instead of next working days or immediate as promised), barely have any advisors available and downright just a primal banking service that is not catching up with the efficiency of today's banking technology. Also it takes a really long time to open a bank account, because they insisted on sending everything via primal snail mail and confirmation is done via snail mail too, whole process took me 1.5 months to receive ebanking details. I DO NOT RECOMMEND AT ALL!",
    "rating": null,
    "sentiment_label": "AVOID AVOID AVOID"
  },
  {
    "text": "Nothing other than dishonest and deceitful. Do not expect them to act with integrity, they ploy loan shark tactics, buyers beware. Go to a more respectable Bank.",
    "rating": null,
    "sentiment_label": "Nothing other than dishonest and…"
  },
  {
    "text": "Worst bank I've ever opened an account with. Refuse to speak English (even though they claim to be \"international\"), communicate very slowly if they even reply at all. I was supposed to have a free account because I am a student and I proved this on time, but they still made me pay for it. Another problem: I moved to France last year but then I moved back to my home country. I still had money in the account, but I could not transfer this to my own account without having a French phone number. However, the only way I could change the phone number was by stopping by in their FRENCH office. They claim they have world wide services, but this is not the case AT ALL. Bureaucratic, slow and very rude. I would not recommend opening a bank account here.",
    "rating": null,
    "sentiment_label": "Worst bank I've ever opened an account…"
  },
  {
    "text": "Very ridiculous experience. Was waiting a new bank card for my account for 2 months. Apparently after 3 times I received 2 cards one day apart. I can’t get pin code to my new card. Never seen anything like this. I wouldn’t have trust for them to handle real money. Plus I’ve been paying fees for account that I can’t use. They seem to be very confusing and unorganised.",
    "rating": null,
    "sentiment_label": "ridiculous experience"
  },
  {
    "text": "we have had an account at this bank for years. early this year we needed new checks and a new bank card. we visited our branch (we are international customers) and made our request. The items were never delivered so we called back and messaged and texted and tried to escalate but it is more than 6 months. I have visited the branch office but no one is available. They make a phone appointment but don't allow time to pick up the call and then you can't reach them again. This is inconceivable that a bank can just cut off access to getting your money out by check or card. The only business we can do is through auto payments.",
    "rating": null,
    "sentiment_label": "6+ months and still can't get checks or a bank card or a person to talk to"
  },
  {
    "text": "Here we go again folks, no further forward.Correspondence and documents still in French, no answer to e mails, n o answer to telephone which rings and rings. Came across B NP Fortis for complaints and thought Whoopee, all the info in English.Turned to fill in complaint form and guess what, ALL IN FRENCH! You couldn't make it up could you? All the lies they tell about how much they care for you and how brilliant they are at customer service. In reality they are laughing at customers and disregard how much British people contribute to their economy.Wonder what would happen if everyone closed their accounts, dumped their French property and walked away? Nothing folks, absolutely nothing for this is sheer arrogance and it is never more obvious when they have not addressed a single complaint on Trust Pilot. Je suis gobsmacked!! The lunatics are still running the asylum.",
    "rating": null,
    "sentiment_label": "Here we go Loopy Lou or \"once more u nto the breach\""
  },
  {
    "text": "I called to open an acoount with them, to understand process, they were SO RUDE. Waoh. Thank you Parisbas",
    "rating": null,
    "sentiment_label": "I called to open an acoount with them"
  },
  {
    "text": "This is the worst bank ever!! Just a bunch of thieves. They sold stocks that I had without my consent and at a loss to boot. They start you off without any monthly fees only to later add them. These monthly fees aren’t even the same every month. At one point they wanted me to pay $10 a month for a simple checking account. I just closed my accounts with them today and this is the best financial decision I’ve made.\nTheir customer service is also non existent... I’ve never been so disrespected as a client as I have been by BNP Paribas. Good riddance!",
    "rating": null,
    "sentiment_label": "Worst bank and customer service ever!"
  },
  {
    "text": "They don't allow you to increase your debit limits even if it is your own money and they debit it automatically from your account. even to withdraw your own money has limits. i asked them to change my card to increase the limit but its not possible",
    "rating": null,
    "sentiment_label": "poor banking policies"
  },
  {
    "text": "I must say that i don’t see why all the negativity.. I have had an account with Bnp for 12 years and all has been good. Even took a loan 4 years ago and so far the service and all has been ok.",
    "rating": null,
    "sentiment_label": "I must say that i don’t see why all the…"
  },
  {
    "text": "Use the company for finance for my van, which I paid in full for a 3 years term.\nYear after I received a letter asking for extra £1200 for nothing I have been surprised and shocked. Absolutely ridiculous. DON'T use them, absolutely crap.",
    "rating": null,
    "sentiment_label": "Use the company for finance for my van"
  },
  {
    "text": "Not worth one star. Have been waiting a month to unlock ridiculous Digital Key. Still waiting and they are now saying my code secret is out of date. Sent at least a dozen emails to councillor without any success At my wits end as need to access my account. Have rung no one speaks English. Absolute disaster.",
    "rating": null,
    "sentiment_label": "Not worth one star"
  },
  {
    "text": "May 2022: Tried to open a joined account with my elderly mother in order to continue business in case of succession. Took 2 appointments to finally talk to Stephane Campillo in Bordeaux. Said he would get back us, but never did. After 3 weeks my mother made a 4th appointment only to be told that it was decided\n\"we didn't need the account\". No valid reason given. Not even an email notification. The arrogance and absence of any consideration for customer services is mind boggling.",
    "rating": null,
    "sentiment_label": "Extremely poor customer service at BNP/ Bordeaux"
  },
  {
    "text": "Slow, not working as advertised, incapable customer service or inferior technology. Cannot even make international payments or transfers, been weeks without them fixing it.",
    "rating": null,
    "sentiment_label": "Slow & useless"
  },
  {
    "text": "Banked with them for years. Dealt with the international division. A worse, more dysfunctional organisation you cannot imagine.\n- hopeless website\n- couldn’t care less ‘foncionnaire’ attitude staff\n- archaic procedures\n\nIf you make a request and your advisor goes off sick (as they often do), your request just sits unattended, ignored even when it involves huge sums of money happened twice in 2 years to me).\n\nSo happy to finally be closing my account - but even for that they wanted a hand written snail mail letter (not French law, bnp law). I sent it and advisor went off sick so request ignored. You couldn’t make it up.\n\nHopefully the new fintechs will see off this irrelevant dinosaur\n.",
    "rating": null,
    "sentiment_label": "Banked with them for years"
  },
  {
    "text": "Deposited money at the counter (guichet) on a Friday afternoon. Today is Monday 3.15pm and the money is still not on my account. It is listed as previsionnel. It is very hard to understand this, a friend of mine using another French bank deposit the money and it is on instantly. A System (like many of the French Systems) totally outdated. Anywhere in the World if you deposit money at the counter of a bank It is on immediately.\n\nWhile my account in charge is excellent and tries everything the system is bad. Same goes for a new card for which I am waiting since a week.....",
    "rating": null,
    "sentiment_label": "Deposited money at the counter…"
  },
  {
    "text": "BNPPARIBAS = Bureaucrates inefficaces sans sens du service client / du jamais vu.",
    "rating": null,
    "sentiment_label": "BNPPARIBAS = Bureaucrates inefficaces…"
  },
  {
    "text": "The worst bank ever. Simply ridicolous. Never had a worst experience.",
    "rating": null,
    "sentiment_label": "The worst bank ever"
  },
  {
    "text": "Horrible banque ! Arnaquers !!",
    "rating": null,
    "sentiment_label": "Horrible banque ! HARCELEURS .. Arnaquers .."
  },
  {
    "text": "I hardly ever write negative reviews unless it is truly bad. This bank is a joke unfortunately. Worst non-responsive, unprofessional, incompetent customer service. Their Service international section is a joke. My mother who is unable to travel due to covid, has been requesting a code to access her account virtually. The bank has been clear with what information she needs to provide to complete transactions. She has been on the phone for hours trying to resolve the issue, customer service attempts to call but \"glitchy disconnects\" continue to happen. Very outdated technology and procedures. My mother asked to speak to a supervisor. They requested to write a letter and send through post mail to talk to supervisors.... Basically, they are keeping my mother's money hostage. She cannot access her account because they don't want to send her a code to access virtually, she is not receiving bank statements, is unable to check her balance, unable to transfer money, unable to communicate with a competent customer service agent. DON'T OPEN AN ACCOUNT THERE. IF YOU HAVE AN ACCOUNT, LOOK SOMEWHERE ELSE.",
    "rating": null,
    "sentiment_label": "TRULY THE WORST BANK"
  },
  {
    "text": "The worst bank you can possibly imagine! Even one star is too much for this organisation. I opened my account one month ago, and even when I came there for the first time, the manager was around 40 minutes late for the meeting! I don't speak good French and that is a huge problem.\nAfter I opened the account, I didn't receive a card and a pin, and it turned out that the manager did not write my address correctly, so such a precious thing like my bank card together with the pin were sent to the wrong place! But even that is not the end! My manager gave me the wrong e-mail and wrong phone number, so I can't contact her, I went to the bank to request a new card. They blocked the old one, created the new one, and one week later I received everything, the code and the card, but however, the pin they sent me was incorrect, when I went to the bank again, the lady at the reception was extremely rude, telling me it's not her fault because it's not her who is sending the post. She told me to go away and wait. However, she did not tell me if the correct pin was sent, she did not even make an effort to check anything on the computer. She just started speaking faster French to make me freak out and leave. I will definitely leave the reviews everywhere possible and return ASAP with someone french-speaking because I have a lot of money stuck in this terrible bank without an opportunity to use it.\nTerrible. Shame on you, BNP.",
    "rating": null,
    "sentiment_label": "The worst bank ever"
  },
  {
    "text": "this bank is not ready to deal with international customers. Very poor service for someone who does not live in Belgium, where I opened an account a very longtime ago, but do not longer live there. I advise using banks more used to an international clientele. Very poor service. Also, half the time their online help service does not work.",
    "rating": null,
    "sentiment_label": "Poor service"
  },
  {
    "text": "Terrible bank and the worst customer service ever, inefficiency for everything and high costs for almost every single transaction, what a mistake to have my money here, trying to close the account and not even for that they will help me.",
    "rating": null,
    "sentiment_label": "Terrible bank and the worst customer…"
  },
  {
    "text": "The worst bank and worst customer service ever! please avoid.\nBad deal, bad deal, bad deal.",
    "rating": null,
    "sentiment_label": "The worst bank and worst customer…"
  },
  {
    "text": "I bank through 4 banks in 2 countries and BNP has the worst service by far. Closing my account as soon as I arrive back to France and opening one through Credit Agricole.",
    "rating": null,
    "sentiment_label": "BNP customer service is horrendous"
  },
  {
    "text": "Nightmare. \"The bank for a world that never changes\". Impossible to speak to anyone who can answer a question. I have a professional account and my dedicated account manager is never available. I keep getting transferred to another branch and all they can do is leave a message...which isn't answered. Impossible to know what is happening with important transactions. Extremely slow, even when you use their so-called digital apps. They're completely out of sync with the market and with the needs of independent professionals.",
    "rating": null,
    "sentiment_label": "Nightmare"
  },
  {
    "text": "I have been wrongly debitated a house insurance that I cancelled 1 year ago. Nothing has been done to be solved. Lest time I could talk to my account manager was 4 months ago. Since then he did not reply my e mails. He told me I would be reimbursed. I have already spoken with him 5 times (In March 2021) per telephone and I trusted the service of the bank and his word.\nThis is not the first time I have problem with wrongly debited fees, the only difference is that this time I have not been reimbursed.\nI have all the e-mails proving I cancelled my room insurance.\n\nI AM EXPREMLY DISSATISFIED",
    "rating": null,
    "sentiment_label": "I have been wrongly debitated a house…"
  },
  {
    "text": "Nothing is urgent for BNP\n\nI lost my card and phone and I asked them to send me a new one. It took them 10 days to send me a bank card which was not even mine! After such a grave security breach, their approach is laid back as they enjoy their bureaucratic time in peace. Leave yourself to the mercy of time because BNP won't be there for you in the times of crisis.",
    "rating": null,
    "sentiment_label": "Nothing is urgent for BNP"
  },
  {
    "text": "",
    "rating": null,
    "sentiment_label": "This website is nearly useless."
  },
  {
    "text": "Clearly the group do not care that their service is appalling....\n\nWe may money for an English speaking service. We are getting nowhere with a simple request to change the account where our mortgage is paid from. In fact we got threatened rather than helped.\n\nStill waiting after 4 weeks for a response to change the payment despite responding to an email immediately.\n\nRidiculous service.",
    "rating": null,
    "sentiment_label": "Clearly the group do not care that…"
  },
  {
    "text": "If this Bank is not funded by the State, I don't see why they can still exist.\n\nIf you like software testing and debugging, this is your bank. If you want to transfer funds and do normal bank stuff, go somewhere else.",
    "rating": null,
    "sentiment_label": "How can they exist in the current marketplace?"
  },
  {
    "text": "Absolutely shambles of a company keep away you would think twice considering when during a pandemic people are out of work the company to sympathise but no they are cold hearted and only out for themselves and to rain on someone’s parade especially during a national lockdown when majority of people can’t go out and earn a living",
    "rating": null,
    "sentiment_label": "Absolutely shambles of a company keep…"
  },
  {
    "text": "I was with BNP for 7-8 years, having moved to England from France I wanted to close my account, the bank has since avoided and not responded to my request to close my account and has been the only entity billing me on the account for 'contributions'. These have not been insignificant amounts putting it in overdraft and because of overdraft they bill me more putting me in an endless loop where I'm paying the bank for NO SERVICE. This is an AWFUL outdated service with a terrible app and communication with their clients. Considering I have made no expenses on the account since nearly a year now the fact they continue to bill me such amounts like 40 euros is horrendous and more so as they have been ignoring my requests to close my account",
    "rating": null,
    "sentiment_label": "I was with BNP for 7-8 years"
  },
  {
    "text": "It's the worst bank in France. DISGUSTING behaviour towards their clients, you will have to run after them if you want them to do their job. DON'T PUT YOUR MONEY IN BNP's hands. You will regret it!!!",
    "rating": null,
    "sentiment_label": "It's the worst bank in France"
  },
  {
    "text": "BNP Paribas France want to see a copy of my ID again. Either their website isn't working at all or I click on the button to upload my ID and it just whirs.\n\nI think my card may have been blocked last week because of this and I'm losing patience. I can't upload the idea via their app either so it seems I'll have to do a one hour plus round trip to their nearest branch to me.",
    "rating": null,
    "sentiment_label": "I'm losing patience with their website"
  },
  {
    "text": "Honestly the new staff provided the worst customer service I ever had with BNP, very unprofessional and rude. I have been a customer for over 10years to just be treated like crap by their new staff. They know no culture as to how a customer should be treated, the operations became ridiculously random. Their new personnel needs to be reviewed. AVOID THIS BANK AT ANY COST.\nIt’s becoming a bad deal.",
    "rating": null,
    "sentiment_label": "UNPROFESSIONAL NEW PERSONNEL"
  },
  {
    "text": "Worse bank ever. No response from anybody. My daughter opened an account when studding abroad and had to leave France because of COVID. The were suppose to transfer the remaining funds to us in USA. it has been over a year and no money. Bank who steels from the customers. Unbelievable.",
    "rating": null,
    "sentiment_label": "Bank which steels from customers"
  },
  {
    "text": "Where do I start? This is the worst bank ever and a massive insult to the French people and it's economy. Unknown charges on the account, missing bank cards in the post and they don't accept a UK mobile number as you must have a French mobile number. I had informed them that I hadn't received my bank card in December and they issued a new card which I collected from Klebber Avenue branch in central Paris. You can't change the card pin? They cancelled this card in April as they just saw the request from December? What a joke. I don't know whether to laugh or cry. I am a foreign national working here and was referred by my company as I required a French Bank account to receive my pay. I am totally appalled at the way I've been treated. PLEASE PLEASE PLEASE AVOID THIS BANK",
    "rating": null,
    "sentiment_label": "DISGUSTING BANK AND A SHAME ON THE FRENCH NATION TO HAVE THIS COMPANY"
  },
  {
    "text": "Worst bank I have ever encountered - after living in 3 different countries. From their customer service (or lack thereof) I can only tell one thing - they are not interested in new clients. I wonder how they treat existing clients, but I will never know - I have been denied to open an account even after filling the request online, making a copy of all my documents and sending it to them BY POST(basically doing THEIR JOB), because there is no option to take an appointment. It’s unbelievable in 2021. In another bank I got an appointment and opened an account within 24h. So Thank you BNP for this experience, now I learned to appreciate my new Belgian bank even more, comparing to you!",
    "rating": null,
    "sentiment_label": "Worst bank I have ever encountered"
  },
  {
    "text": "",
    "rating": null,
    "sentiment_label": "Worst bank ever."
  },
  {
    "text": "The worst bank EVER. When I try to add new beneficiaries, it shows me an error. I've already called then several times. I've even gone to the agency to ask for help and they didn't know what to do. Which means that I can't transfer money to other new accounts. It sucks. And the app is always with problems, sometimes you can not log into your account.",
    "rating": null,
    "sentiment_label": "The worst bank EVER"
  },
  {
    "text": "I've been trying for over a year to close my bank account. I went to my agency in person for 3 times and gave a signed document that stated my desire to close. I returned them my card.\nThey said it was fine but they kept my account for over a year and continued to charge me atrocious fees of 6.66 euros per month. They're not answering my numerous calls, Tweets, emails and messages.\nThey said they'd let me know once they've closed the account - turns out they closed but still didn't reimburse me for 12 months of unjustified fees.\nSCAMMERS.",
    "rating": null,
    "sentiment_label": "The worst bank ever"
  },
  {
    "text": "Expensive and Hard to close the account\nToo much time spent writing and phoning to people in order to close my account. A real struggle.",
    "rating": null,
    "sentiment_label": "Hard to Get Out"
  },
  {
    "text": "Don't deal with this bank\nThis was the worst banking experience i have ever had. after i filled all the online papers I called to have an appointment and i told them about my full situation (i'm staying in France for 6 months) they said okey. after a week of waiting i went to the agency and gave her my papers. she said no you can't make an account close to your work because it's only for 6 months and she set another appointment for me the week after with another agency. after another week of waiting i went there and she said \"oh sorry sir we can't open you an account because you only have a visa\"\nthey knew the whole situation from the start and i wasted three weeks. don't deal with this bank",
    "rating": null,
    "sentiment_label": "Don't deal with this bank"
  },
  {
    "text": "I am French/American and have had an account with BNP Paribas for two years. I've had nothing but hassles with them, always requesting documentation that they couldn't explain to me, because they didn't understand. Today I received an extremely rude letter from them saying \"We no longer wish to do business with you and are closing your account.\" They didn't give me a reason why, and when I went to the bank they just said, \"That's the way it is\". AVOID THIS BANK AT ALL COSTS.",
    "rating": null,
    "sentiment_label": "If you are French/American DON'T DO BUSINESS WITH THE BNP PARIBAS!"
  },
  {
    "text": "Sharing my Experience with UBCI - Groupe BNP Paribas BNP Paribas France\n\nI had a assurance D'habitation and a Bank account with BNP Paribas Toulouse. Here is my review of the Bank.\nif you need to get anything done, you need to take an appointment, when you reach the bank there is no guarantee that the person you are supposed to meet is available (happened 2 times).\nTheir Online services are as good as an offline bank in India, there is no bank in India which has this bad services (except gramin bank but then they claim they are offline)\nIf you speak English, this bank is not for you, go for HSBC.\nPathetic, I mean Pathetic customer support. I chased them for 1 Year (as of today) for my refund and the response I got was that we are sorry we sent a cheque in July for refunding 15 euros (never received) where as they owe me over 60 euros. After 40+ Emails to different departments, all I got was disappointment. If I go and type BNP in my Gmail Sent items, the amount of emails I see are astonishing as well as their level of negligence.\nI have lived in India where I used to abuse the departments (1990-2005), Never have I come across such level of negligence.\n\nAll I want to say is that being an expat all you want to do is close your economic activities as per law. you wouldn't want to end up in situation where you owe money to any department. As you are aware that the deductions in most places are automatic, getting them refunded or stopping them is a hassle. If the bank is not supportive, it is you who lose money. My suggestion is that always go with an International bank like HSBC. In 2021 if a bank is not digital it will not survive. do not put your money in such a bank.",
    "rating": null,
    "sentiment_label": "Worst Bank EVER. I mean EVER"
  },
  {
    "text": "I've opened an account with BNP, 1 and a half month ago.. Since then I à cannot get in touch with them. So my employer paid my Sallery into the account and BNP have closed the account.\n\nSo no accès to my money, no reply on the internal mail system, they don't call back when I book a time...\n\nThis is horrible service.. Absolutely horrible..\n\n1 and a half month.... And still frozen!",
    "rating": null,
    "sentiment_label": "I've opened an account with BNP"
  },
  {
    "text": "Well this company has to be the worst Ive ever had the misfortune to deal with.\nI brought a van directly from them in July 2020, it’s now 2/2/2021and I’m still waiting for an acknowledgment of payment of £18500 for the van.\nstill waiting for a VAT invoice.\nStill waiting for a call back.\nStill waiting for a reply to my email.\nStill waiting for someone to answer the phone.\nStall waiting and waiting and waiting.\nPlease DO NOT us this company for anything, you will been warned!!\n\nTime to get the FCA involved now.",
    "rating": null,
    "sentiment_label": "Well this company has to be the worst…"
  },
  {
    "text": "Found to be one of the most disappointing banking establishments I have ever come across. Also there charging fees are expensive beyond the normal. I started applying for a loan an never received anything. Every time I pay a fee another pops up from no where. Its like they wait tell you pay the first one to inform you about another. I am at the point where I would like some to help me get the law involved.we need to put a stop to this there jus too many victims. Wat ever you do DONT send them any cash or open any account with this bank",
    "rating": null,
    "sentiment_label": "BNP scams poor people in the worst time in financial history when people have little to nothing left."
  },
  {
    "text": "I have the worst experience with this bank. I have asked since 31/8/2020 to close my bank account and despite the letter and the multiple e-mails I sent, no action has been taken yet. The funny thing is that in the last email (a month ago) they assured me that within 15 days they will close the account permanently. I am completely disappointed and find this handling of customers outrageous. It is the worst treatment that I have ever encountered from any other similar organization. I consider myself a victim of fraud. I am in another country that is in quarantine, in the midst of a pandemic and I am trying to escape from this entire situation. If I had to give one piece of advice it would be \"stay away from this bank\".",
    "rating": null,
    "sentiment_label": "The worst experience"
  },
  {
    "text": "I visited the Argeles sur Mer branch nearly two months ago,with all the required paperwork,in order to close two accounts.The paperwork was verified and accepted.Despite various reminders the accounts have still not been closed and funds transfered.Bank charges still being made and impossible to get any response from them.\nDreadful customer service.",
    "rating": null,
    "sentiment_label": "Dreadful customer service."
  },
  {
    "text": "One of stupid and miserable customer service I have ever experienced in my entire life of banking with bnp parivas. Just a small issue they don't want to pay attention and as business background student I always believed \"customer is always right\" but in bnp parivas customer point of view does not even get a single attention at all. They always charge money and they can't explain and if the bank is not there to help customer then why even fake marketing and as student dealing with bnp parivas extremely awful... I am sorry for what I am saying but not one time bad miserable customer service happened with me and some of my friends countless time... I wonder why we opened an account with bnp.. Sooooo regret.",
    "rating": null,
    "sentiment_label": "One of the miserable customers service"
  },
  {
    "text": "Horrible. I asked them to close an account 3 years ago, had to fill in a physical form to do it while I wasn't even in the same country anymore? Why?\nI haven't found a way to access my account or get in contact with them yet.",
    "rating": null,
    "sentiment_label": "Horrible"
  },
  {
    "text": "I regret creating an account with BNP Paribas, very low service with inexperienced staff, clients are so badly treated....Really : No one positive point.... It's more better letting your money on the street than putting them at BNP bank. The hell worst bank I ve seen ever.....",
    "rating": null,
    "sentiment_label": "I regret creating an account with BNP…"
  },
  {
    "text": "BNP Paribas - the worst bank ever! I'm waiting for my debit card for almost 2 months and no result. I opened a bank account, ordered a card, waited for a month, reordered a card again because it was \"lost somewhere on the way to be delivered to me\"(ha ha ha). And now I am waiting again! My manager does not answer my messages, nothing happens. Welcome to the hell.",
    "rating": null,
    "sentiment_label": "BNP Paribas"
  },
  {
    "text": "This bank has the worst service ever! BNP needs a serious upgrade of their digital offering, it is frankly pathetic! We are living in the era of globalization and this bank still plays it local!\nWhich type of bank nowadays can't offer remote password resetting, wherever you are in the world? Apparently, you have to be in France for that! ...like sending out paper is deemed more secured. Seriously!",
    "rating": null,
    "sentiment_label": "Nullissime!"
  },
  {
    "text": "This is the worst bank ever ,fees are everything extremely high ,blocking card constantly with zero warning ,English customer service non existent ,impossible to communicate with personal banker she does not reply to my messages ,I’m unable to send money as that option is blocked while I have positive balance I’m sick of this bank and customer service in France over all !!!!!",
    "rating": null,
    "sentiment_label": "This is the worst bank ever ,fees are…"
  },
  {
    "text": "Had to give a rating of 1 as there is no option to give Zero. Do yourself one huge favour and steer clear of this bunch of amateurs. They don`t answer phone calls,you cannot e mail an individual, every action is at snails pace and they never answer a straight question.They are great at taking your money, but its like an act of parliament to get it back\nAVOID these parasites !!!!!!!!",
    "rating": null,
    "sentiment_label": "AVOID LIKE THE PLAGUE !!"
  },
  {
    "text": "No Fraud Alert System/ No Compensation\nIn September 2019 I was the victim of a sophisticated fraud at a bike rental terminal in London. The French crook, who asked for my help, persuaded me--assisted my a fake \"help-desk\" accomplice --to use my Lloyds, then HSBC and then BNP Paribas Fortis cards, all swallowed by the machine. Subsequently the French scammer recovered the cards and took money from all three accounts including the 3000 Euros monthly limits from my BNP Paribas Fortis account ( and the lower daily limit from my Lloyds and HSBC accounts). BNP Paribas Fortis systems were unable to recognise as fraudulent the nine withdrawals/debits within a very short period but the more effective HSBC fraud alert system warned me. I then phoned Brussels to block the Fortis card. Lloyds and HSBC reimbursed me in full without delay. The Belgian bank decided that, in its own judgment, I had committed \"gross negligence\" in not recognising the loss of my card as a potential theft,saw no obligation to compensate wholly or partially and rejected my claim out of hand. Totally self-serving, heartless and incompetent. Don't think of opening an account with BNP Paribas Fortis !\nRB",
    "rating": null,
    "sentiment_label": "No Fraud Alert System/ No Compensation"
  },
  {
    "text": "From my experience, I do not trust my money will be safe in this bank. Please consider other banks. Would have given this bank 0 star.",
    "rating": null,
    "sentiment_label": "DO NOT open an account with BNP"
  },
  {
    "text": "I have been sending e-mails and trying to call but cannot get through to them, and they do not respond to my e-mails. Also, considering that this bank caters to A LOT of expats, I am shocked that they do not have an English telephone service up and running!\nAlso, they had blocked my card (eventually got swallowed) because I needed to send in proof of address. I never received an e-mail about this. So, that is abdominal service and to me rather unprofessional. There should have been an e-mail at best before, and I should not have found out the hard way!\nWhen I finally did get an appointment, they were not very polite. The lady at the counter had a, how do I put it, a serious and unpleasant face. She came across very arrogant and did not at once smile.\nOverall, I think once I have access to my account, I will switch banks, where the bank truly values its customers/clients and upholds their values.",
    "rating": null,
    "sentiment_label": "Contact and Support"
  },
  {
    "text": "Do not join BNP Paribas Fortis.\n\nI was recommended to join the bank by my university when moving to Belgium. I had previously been with ING for 7 years, who provided excellent service the whole time. Joining BNP Paribas was a huge mistake.\n\nMy account was blocked without notice, and i was left without access to my money, not even to withdraw it to leave the bank, for 9 days. Customer Service Helpline, was largely un-empathetic, uncooperative and at times rude. Numerous documents were requested to unblock the account, which i immediately provided however they were rejected several times without any reason being given.\n\nI would highly recommend anyone contemplating joining BNP Paribas Fortis to walk 150metres down Avenue Louise and join ING instead.",
    "rating": null,
    "sentiment_label": "Do not join BNP Paribas Fortis."
  },
  {
    "text": "The worst bank in the world !!!! the charge you for the RECEIVED transactions 7 days after you received the money. So, you never know how much money you have received from the client",
    "rating": null,
    "sentiment_label": "The worst bank in the world !!!"
  },
  {
    "text": "Absolute nightmare!\n\nConstantly blocking your card, with money in the account. Online service unavailable. High commission fees. Just an absolute nightmare all way around.",
    "rating": null,
    "sentiment_label": "Awful service."
  },
  {
    "text": "",
    "rating": null,
    "sentiment_label": "Worst bank ever!!"
  },
  {
    "text": "My stepfather Died 18 months ago All procedures have been followed and the bank has still not released the funds to the estateThe lawyers have sent numerous Emails and no response My mother is ailing and these funds are critical to her survival",
    "rating": null,
    "sentiment_label": "My stepfather Died 18 months ago All…"
  },
  {
    "text": "Opened an account for my daughter in France as she is studying there. It is like stepping back 30 years - almost pre-internet. they are slow, expensive and hopeless. We just spent a week in the UK and they charged commissions on my daughter's debit card of 10% to about 25%. Incredible. If we had used our Australian debit or credit cards it would have been nothing like that. If you are in France and need a bank account, go anywhere else other than BNP - or better still get a Transferwise or N26 account and leave BNP well alone.",
    "rating": null,
    "sentiment_label": "Expensive, old-fashioned - go anywhere else"
  },
  {
    "text": "I'm at the agency Paris saint Germain (international) and I think it is the worst ever. I can't believe how childish and unprofessional they are. I opened my account when I was in Uni, and It was alright because I never had any issue with them during 8 years, I was never in debt or asks for a loan, but recently I had a new banker who is seriously the worst, very bad customer service, ghosting me, pretending he was in holidays so he doesn't answer my mails or phone calls when I needed him! When I called at the agence they answer to me in an awful rude way, letting me know that they are not going to do anything to help. They made a mistake by withdrawing my account twice for a visa card that I never ask to be renewed, they never repay me the money due, and they never answer to the letter I send to the agency. I had to write a letter to the customer service, contact the chat on the app, that continued for 1 year and half until I finally got my issue solved! When I will be back to France, and start my carrier, I will change bank because this one is AWFUL. This kind of problem will never happen in Australia or New Zealand, where I moved since 4 years.",
    "rating": null,
    "sentiment_label": "Agence Paris saint Germain the worst ever…"
  },
  {
    "text": "This bank is absolutely a waste. They are slower than the tortoise. Very bad service, to open an account, they will take a month. Seriously pls find another bank of you are coming to France.",
    "rating": null,
    "sentiment_label": "BNP Paribas- Horrible services"
  },
  {
    "text": "There mobile app has so many bugs I’ve stopped using it all together. Even a simple bank wire is complicated, the contact form of the app is ‘momentarily unavailable’. How can you do so many things so wrong ?",
    "rating": null,
    "sentiment_label": "Mindbogglingingly awful"
  },
  {
    "text": "They didn't fix the ATM for more than 2 weeks. After 2 weeks I went to visit another ATM at a different location and it was broken as well.",
    "rating": null,
    "sentiment_label": "They didn't fix the ATM for more than 2 weeks"
  },
  {
    "text": "No customer service, poor quality, avoid if possible.",
    "rating": null,
    "sentiment_label": "No customer service"
  },
  {
    "text": "Total catastrophe. They make you loose your money either because of lack of professionalism or on purpose. Two months after the official closure of my Account they were sending me letters with the penalties which I couldn’t understand. Finally it turned out that the account was still not closed despite all of the formalities which were completed. Extremely unprofessional service at the Boulogne Jean-Jaurès branch.",
    "rating": null,
    "sentiment_label": "Total catastrophe"
  },
  {
    "text": "Horrible customer service, they do not care about you! Do not get an account here unless u want to have 0 support and goodluck if you have any issues ! Will take at least a month if you are lucky! Ice never seen such a skammy bank.",
    "rating": null,
    "sentiment_label": "Horrible customer service"
  },
  {
    "text": "BNP is getting worse by the day. The bank is expensive, complicated and not responsive. I have not succeeded in getting hold of my \"personal advisor\" for more than one year, I have called multiple times, left voice messages, sent about 10 mails, including to the head of the agency, to no avail.\n\nToday, my credit card had a technical issue and was advised by the card company to call my bank advisor. I tried and as usual I got an automated message. I tried the 3477, talking to a computer which understood that I have a card issue but when entering the customer number the computer tells me that the bank has a technical issue and cannot verify the number. The technical issues of BNP Paribas has made headline news multiple times this year.\n\nI tried the the number of the agency, did not get through to the bank. I tried another number and I did not get through. I tried 3477 again, telling the computer I wanted to open a new account, since that would not require verifying my existing customer number and I was put into a waiting queue, after a long time, they just hang up on me.\n\nI have opened an account with Revolut, works without any problems. Even employees of BNP Paribas use either N24 and Revolut to get things done, it is simpler, faster and cheaper.",
    "rating": null,
    "sentiment_label": "BNP Paribas"
  },
  {
    "text": "The worst bank ever!!!!!!!!!!!! - Waiting unlock netbanking for 4 hours",
    "rating": null,
    "sentiment_label": "The worst bank ever!!!!!!!!!!!"
  },
  {
    "text": "The design is poor, no real actions and when you need to return to the agency they say they cant do it and you have to do it online or call a phone number and the call center is not helping,",
    "rating": null,
    "sentiment_label": "The design is poor"
  },
  {
    "text": "Today had a meeting with 1 agent in kruibeke\nIm so glad and happy i dont know the name of this women she was so helpfull znd good\nGood job maam\nThis bank in kruibeke bazelstraat is the best\nBy the way i live in sint niklaas",
    "rating": null,
    "sentiment_label": "Today had a meeting with 1 agent in…"
  },
  {
    "text": "BNP Paribas cannot answer the phone for the life of them. To reply to an e-mail is beyond their possibilities. There is no limit to the slowness of their service... There has to be better banks in France... This is worse than bad. It is pathetic...",
    "rating": null,
    "sentiment_label": "BNP Paribas cannot answer the phone for…"
  },
  {
    "text": "Pire jamais banque! Le conseiller ne répond jamais à vos questions. Ils vous contacteront quand ils auront besoin de votre abonnement, mais lorsque nous aurons besoin d'annuler le contrat, ils ne répondront jamais à votre appel ni ne le traiteront ...\n\n-- english--\nWorst ever bank! The Counseller never responds to your queries, They will reach out to you when they need you to subscribe but when we need to cancel the contract they never respond nor entertain your call...",
    "rating": null,
    "sentiment_label": "Pire jamais banque"
  },
  {
    "text": "A few month ago I opened the account in polish bank, then a month later Paribas bought this bank and I bacame their client, now when I try to enter my account trough the password reset I get errors, tryed to call to support department, but got no answer, the same with emails, so as I see it, this bank just robbed me of my money.",
    "rating": null,
    "sentiment_label": "Never make any dels with BNP Paribas"
  },
  {
    "text": "BnpParibas cardif has the worst client service ever.no one replies to the calls and emails...they have sent my money to another person...can u imagine!!a bank that doesnt know how to do a normal transfer....it has been 3 months pending...",
    "rating": null,
    "sentiment_label": "BnpParibas cardif has the worst client…"
  },
  {
    "text": "This is a bank of nightmares. On December 7, 2018 a transfer was sent to their Polish bank (BGZ BNP PARIBAS) which was never credited to the recipient. This was notified to the recipient only on December 19, 2019. At the same time, the payment was not returned to the sender in a timely manner. I made a withdrawal of payment. For a long time neither the Polish and French( BNP PARIBAS)banks simply did not respond to the requests of my bank. Then the Polish bank reported that on January 7, the payment was returned --- but the money did not come. Then, in another letter, the bank reported that they sent the payment on January 15, but this time the money was not returned. Only after numerous letters from my bank, the payment was returned on April 4, 2019",
    "rating": null,
    "sentiment_label": "This is a bank of nightmares"
  },
  {
    "text": "The worst banking experience I've ever had in my life. BNP Paribas stole my money when closing the bank account - luckily not a big amount (around 40 EUR), but they simply closed my bank account from day to day and never sent me the balance that was left there. To this day I haven't even received the closing statement, despite asking for it several times via phone, mail, facebook and even visiting a branch physically.\n\nI'm not going through the haggle of suing them because of 40 EUR - something they obviously rely on - but I strongly advise everyone to avoid these thieves.",
    "rating": null,
    "sentiment_label": "The worst banking experience I've ever…"
  },
  {
    "text": "Blocking our account without any explanation for more than 1 full week. We asked 3 times for the reason, there is considerable of money to cover all expenses. Our branch in Stockel is incapable to find out why! No resolution although they know their blocking is unlawful.\n\nThey seriously asked us to write a letter to their head office and ask for explanation!!!\n\nGuys, stay out, these people are absolutely not trustworthy. Changing my bank.",
    "rating": null,
    "sentiment_label": "BNP breaking the law - but don't care."
  },
  {
    "text": "STAY AWAY FROM THIS NIGHTMARE!\nThis bank is the worst bank even in LYON France, specifically in Victor Hugo and 39 Rue Grenette, 69002 Lyon Branch! For foreigners, students, people from all around the world! This bank is a scam! Worst customer service! They have no proper communication with their other branches/colleagues.\n\nWORST BANK IN EUROPE! THEY SHOULD SHUT DOWN!\nMy experience was a nightmare! I was tossed with different bank branches of BNP just to resolve an issue (to withdraw my money since i still dont have my card yet). PLEASE STAY AWAY FROM THIS BANK IF YOU WANT TO SAVE YOUR TIME AND MONEY.",
    "rating": null,
    "sentiment_label": "STAY AWAY FROM THIS NIGHTMARE!"
  },
  {
    "text": "Please save yourself the frustration and find another bank. BNP staff are completely unresponsive, their online banking needs confirmation emails and calls (which might get a reply after 1-2 weeks), and their system doesn’t talk to itself so you are continually battling to prove very basic information.\n\nWhenever we try to do an online transfer, nothing happens for a week and we have to keep chasing BNP.\n\nIt’s a small amount to a pre-approved beneficiary.\n\nBNP already has my mobile phone approved in your system (via letter and then entering the security code) and they don’t recognise it.\n\nWe spoke a number of times. Each time, they promised an answer in 5-30 minutes and didn’t contact me as promised and so I had to keep chasing them.\n\nThen they made me do this extra work, sending photos of business cards, and for what? Just wasting more of my time.\n\nThis is completely unacceptable. I’ve banked around the world and this is by far the most appalling experience in my life.",
    "rating": null,
    "sentiment_label": "Possibly the world’s worst bank"
  },
  {
    "text": "In Italy this bank is called BNL. It’s the worst bank I have ever had account in. They have the poorest costumer service. They should be banned in Europe.",
    "rating": null,
    "sentiment_label": "BNL the worst bank."
  },
  {
    "text": "BNP Paribas is the worst bank I have ever experienced - and I have done business with about 6 banks from the USA and in developing countries, and the poorest country in Europe.\n\nMy review echoes the same points as all the previous reviews. The bank has unbelievably high fees, like I've never seen before. The bank employees are incompetent, unhelpful, and useless. The bank and its policies are so inefficient, inept, restrictive, impracticable, and stringent that it renders basic transactions nearly impossible.\n\nIt is ridiculous: a bank that does not let you use your own money.\nWhat is the point of a bank if it fails to do all of the basic functions? You cannot deposit money in it freely, you cannot withdraw money unless it's a tiny amount, you cannot transfer money outside of Eurozone, you cannot speak to staff (usually unavailable), you will get charged $90 per year for all this lack of service, etc, etc, etc. Examples:\n\n1. It took 2 months to open my bank account despite having the right documentation and money.\n\n2. Without warning or consent, they began to charge me about 90 dollars per year in 2016, without ever consulting me, without my permission. By the time I saw that they had already taken the money out, I called and email, but they refused to reimburse or resolve the problem.\n\n3. One clueless/ incompetent/ malicious counselor relentlessly threatened that she would closed down my account because I moved out out of the country -- when BNP actually allows all people who move out to keep their account, and other BNP employees I spoke with confirmed it, and has branches specifically dedicated to people living abroad. Apparently she had no idea or missed her training, and chose to keep threatening me, which caused me much stress and anxiety and minor trauma.\n\n4. The bank and counselor is never available. You are assigned to 1 branch only - every time I call, nobody answers.\n\n5. They change your counselor every couple of months - In 2 years that I had the bank, I had about 5 counselors.\n\n6. You cannot deposit money into your account: I exchanged $2,000 and the bank would not allow me to put them in my account, not even in small parts, without producing several pieces of document where the money was coming from. And if you try to deposit money in small amounts, they call you in the bank to ask where the money is coming from -- they assume that you are a terrorist unless you provide 100 pieces of evidence documents to justify YOUR OWN Money!!\n\n7. You cannot withdraw money from it - the limit that you can withdraw is so low that it is not possible to live with it and is virtually useless. This was especially hard when I was working in foreign aid in a developing country, with cash economy, and had to beg them to increase my limit or else I wouldn't be able to survive in the country without the cash.\n\n8. The employees are plain and simple incompetent. They were nice, but it took 2 young men to try to open my bank account (aka input my name and address into their system). One counselor was could not even locate the closest BNP branch to my address even with the map of my address and surrounding BNP banks on her computer screen.\n\n9. It took 4 months to change my address. (This was the point when the malicious counselor also threatened to close down my account altogether because my new address was abroad). Even though BNP allows accounts for people who move abroad.\n\n10. Everything is done through snail mail. Makes everything take weeks or months.\n\n11. The security features are so high and overly excessive (and even involve SnailMail codes), that they prevent people from using their own accounts. This defeats the purpose of the bank. BNP Paribas needs to enter into 2018, it is still 100 years behind.\n\nI can go on and on. I have never been so frustrated, and disappointed with a service like this ever before. Dealing with them for even the smallest inquiry became so stressful that it gave me minor trauma and great anxiety, and I still suffer from those feelings. I have seen banks in third world, developing countries that provide better service.\n\nPlease do yourself a favor and use another bank. Never ever this one.",
    "rating": null,
    "sentiment_label": "BNP Paribas: Worst Bank in the Developed World and Beyond"
  },
  {
    "text": "I have been a customer of this bank since last 8 years..And finally today I just decided that I am done with this terrible customer service... I am travelling and before leaving France I told them several times that could you increase my card limit and the person confirmed that . But once I out of the country it doesn't work. I even called them 3 times and someone always picked up and they told they would get back. But never returned.. just unethical people... We trust out banks and thats how they treat us.... how can a company treat their clients such..Guys please if you are non French just avoid this bank.. they are just terrible",
    "rating": null,
    "sentiment_label": "Most terrible bank ever"
  },
  {
    "text": "The worst bank I have ever dealt with and by far the worst customer service from a company. I've spent 4 months trying to open a French bank account for my year abroad... I'm now halfway through the year and still do not have access to my account. I have sent countless emails to the employee in charge of my account who has not responded. Appalling customer service. Save yourself the hassle and go elsewhere!",
    "rating": null,
    "sentiment_label": "The worst bank I have ever dealt with…"
  },
  {
    "text": "Absolutely useless and complete nonsense in terms of process.\n\nIt got easier for me to Transfer money between two international accounts from my UK bank than doing a money transfer from a BNP Paribas account to another BNP Paribas account.\n\nThey also provided me with a support number bwhich I called from abroad and an automatic message told me \"this number can only be reached from outside France\". Utter nonsense and the least helpful CS!!!!",
    "rating": null,
    "sentiment_label": "Absolutely useless and complete…"
  },
  {
    "text": "Absolutely useless at most things, very hard to deal with, impossible to telephone or email and expensive to boot. I've been trying to close an account now for three months and the charges keep being taken from my account while no action is taken to close a simple account. BNP is simply years out of date with no customer service, high charges and dreadful communications. All the staff seem to take weeks off without any notice and only work 10-12 if they do turn up. Impossible to get another branch to do anything, you have to go to your own branch( I was even told to go to my own branch to change 100 euro note!).\nDo youself a favour, get an free N26 online account and never give any Direct Debits to anyone, pay online by card.",
    "rating": null,
    "sentiment_label": "Absolutely useless at most things"
  },
  {
    "text": "Takes 3 months to change my own address on my profile. First, they change it to my SG address, when I specifically asked them to change it to the UK one. Then they put a weird combination of both addresses which did not make sense.. 15 emails later, they ask for a hardcopy? We are in the 21st century. Until now I have not been able to change my address to change my handphone number on my own account. Worst bank ever",
    "rating": null,
    "sentiment_label": "Takes 3 months to change my own address…"
  },
  {
    "text": "Unfair and INSANE high charges for everything which is hidden in the small print. When I did an internet search I also see they have been fine Billions for various things so it looks like they need to ripoff their customers to pay all the fines",
    "rating": null,
    "sentiment_label": "Unfair and INSANE high charges for…"
  },
  {
    "text": "The way they conduct their business is irresponsible to say the least!\nThey are currently holding invalid address details for us, which they got wrong in the first place and now will not update to our correct address as listed on companies house for some absurd reason. So no correspondence reaches us, it goes to an unknown address which we cannot retrieve.\nWe have asked to have our invoices sent to us electronically which we never receive either, and each time are told they had a system error or some other pathetic excuse.\nI look forward to our contract ending and being able to move forward with a reputable bank next time!",
    "rating": null,
    "sentiment_label": "Irresponsible Company"
  },
  {
    "text": "This bank and especially this branch has been the worst bank I've ever had. I'll explain you some examples: 1. They changes my personal bank consultant many many times and each time they didn't notify me. So each time I had to discover that my 'conseiller' is a new person. 2. Almost all of these 'conseillers' were necer available to respond me over phone or answer my emails on time. It looks like they have few good, motivated and dedicated conseillers that they assign them to their big rich clients and the rest, who are actually normal clients with medium to high revenue range, they assign them to junior or not-dedicated conseillers. 3. Once and only once my account passed the minus limit for a week or 2, for each rejected payments they charged me a big fee. I had all my insurances with them and I always had enough money in my account. You can judge the service when things go wrong and yes they didn't pass. 4. I had an issue with my online account and I sent hundreds of emails, many phone calls, asking for the resolution, and guess what I still have the issue after almost 2 years. 5. I have issues to transfer money online and I have asked for resolution but no answer at all. So each time I have to send money to someone I have to call and ask for the service or go to the bank, and guess what I realized that they were charging me around 4 euros each time they did this for me. 6. My visa card was expiring so I requested a new card, it arrived around 1 month after the expiry of last card, even though I had told them in advance, so imagine 1 month with no card. 7. I received a letter saying that my card is arrived to the bank and is ready for pick up, so I went the day after to the bank and they said it's not here, with no sorrow or anything!!!\nAll in all, I highly recommend that you don't select BNP Paribas.",
    "rating": null,
    "sentiment_label": "Don't select BNP Paribas."
  },
  {
    "text": "BNP-Paribas bank in France invests in companies that manufacture and supply nuclear weapons.\n\nRight now, countries that have nuclear weapons are all in the process of upgrading them. To do those upgrades, a lot of countries use private contractors. Companies like Lockheed Martin, Northrop Grumman or BAE Systems make key components for nuclear weapons. It’s part of the military industrial complex that Dwight D. Eisenhower warned the world about in the 1950s.\n\nCompanies want to make money. So do banks and pension funds. The difference is that banks use their client’s money to make investments, to build up a profit. That’s your money. That’s where you have power.\n\nBanks don’t want to lose clients, so they don’t want to look bad. When we make noise about their investments in Armageddon, investments in doomsday, Banks start looking really bad. BNP-Paribas is one of those banks.\n\nIn some countries, nuclear weapons are completely illegal, but not yet in every country. Some banks, like BNP Paribas, will use this as an excuse, saying that their investments in nuclear weapon producers are okay. But they’re not. There is a moral and ethical line on what is acceptable and what is not. Nuclear weapons are unacceptable, and its time to get the banks on board. How can BNP Paribas say that it’s time to divest from tobacco and fracking, yet not be divesting from nuclear weapons?\n\nSTOP investing in nuclear weapons BNP-Paribas!",
    "rating": null,
    "sentiment_label": "BNP-Paribas: cesser d'investir dans les armes nucléaires!"
  },
  {
    "text": "(Je suis un client étrangère donc je me permets d'écrire en anglais l'avis).\n\nI don´t reccommend BNP Paribas, specially the Online Branch (Agence en Ligne)\n\nI have been client of BNP Paribas since 2015 when I was still student and BNP offered special opening conditions as a business partner from my business school (Ecole de Commerce).\nAfter moving out of Paris to another French city, I decided to join the Online branch (Agence en Ligne). Unfortunately, in the Agence en Ligne I have found the most unprofessional staff from BNP Paribas for several reasons:\n- They haven´t delivered in many promises both economic or just customer-service-based like call backs.\n- They miss 95% of the telephone appointments (you take an appointment and they just don´t call you).\n- Completely unprofessional service after a problem with fraud charges in my debit card. It took 4-5 months and more than a dozen of calls to get reimbursed...\n- They have change my personal advisor several times.\n- They don´t reply the internal messages\n- They have a high-fee structure\n\nIf you are looking for a good online banking provider I recommend you to look somewhere else.",
    "rating": null,
    "sentiment_label": "Dissappointing service"
  },
  {
    "text": "It is the worst bank who does not care about their clients. They charge some random insane fees and they do not explain why do they charge them. I had the worst experience with them - it is crazy to think that this could be international bank. Do not even think about getting their services, you would save more money by not!!!",
    "rating": null,
    "sentiment_label": "It is the worst bank who does not care…"
  },
  {
    "text": "Agreed. It is the worse bank I ever encountered. 4 years with them never one time we felt service is acceptable. The consultants are arrogant, rude and lazy. To have appointment with them it takes weeks or months. When you meet them they made you feel like they are doing you a big favour by granting you an appointment. You can complain you can take it to their superior, no action.\n\nWe moved home and I was hopeful it will be better. I went to new branch to get an appointment. 3 weeks after when I turned up for the appointment a rude and arrogant woman came out \"pas moi\" \"pas rdv\". Now we keep our account really small just deposit and withdraw nothing else.\n\nSadly, the bank has good products but are having idiots with high ego sitting in big office and turn down customers. I suggest they do not waste money advertising for business until their staff is trained to treat customers well.",
    "rating": null,
    "sentiment_label": "Worse bank ? 100% agreed."
  },
  {
    "text": "This is the worst bank ever! Don't make the mistake to open an account there! These people are the definition of obnoxious French people who refuse to speak English!I opened an account when I was living in Paris and in the 5 years I have the account I couldn't find one person to speak English. They are so, so rude and charge insane fees for no reason. The fact that all of the reviews here are so bad says a lot about them.\nSTAY AWAY FROM BNP PARIBAS, THE WORST! BANK EVER",
    "rating": null,
    "sentiment_label": "This is the worst bank ever"
  },
  {
    "text": "Have a Online bank account in France with them. Awful customer support, awful reactivity and overall really bad experience.\nA real pain in the a** to actually talk to your Counselor, even though you may have called ten times or book a meeting.\n\nI DO NOT RECOMMEND THIS BANK TO ANYONE !",
    "rating": null,
    "sentiment_label": "Awful bank"
  },
  {
    "text": "Worst Bank, and client service ever!\nThe Bank charges incredibly high fees for everything. Lost card, delivery of unsolicited mail, insurance, over draft fees and credit card fees.\n\nClient service on the other hand is the worst I've ever experienced in my life.\n\nFrance is very well known for bad customer service, but with this bank it's pushed to another level.\n\nThe account managers are completely unprofessional. Mostly not available, rarely ever respond to emails, do not speak a language other than french, and have a bad attitude that just puts you off from wanting to contact them, as you will get more frustrated and your problems will not be solved.\n\nAfter being charged for years an enormous amount of unexplained fees, and I finally decided to change my bank, I am still unable to close the goddamned account with them.\n\nI have sent the request 3 months ago, and as of this date the account is open. I am also, believe it or not, still being charged for card fees, and other fees for services I can not use, as my account is locked, every single month.\n\nMy frustration is growing and nothing is being done.\n\nAvoid it at all costs for your own good!",
    "rating": null,
    "sentiment_label": "Worst Bank Ever"
  },
  {
    "text": "BNP Paribas branch in Paris Montholon is the worst I have ever seen in 15 years of experience with banks in France. Customer service is equivalent to 0, you can not reach them, they either do not reply to email or reply with weeks of delay, they do not process request. The bank cost me a fortune and is not delivering",
    "rating": null,
    "sentiment_label": "BNP Paribas branch in Paris Montholon …"
  },
  {
    "text": "A bunch of idiots.\n1 - They got my name wrong in the bank account and also in the debit card.\n2 - They got me the wrong debit card (I signed up for a premium one and they got me a standard one).\n3 - I got a second card, this time the name was right but still not premium.\n4 - One day they randomly decided to block my card (?) so I needed to get a new one, AGAIN.\nAll of this happened in 3 months. After that, I just closed the bank account and ran away otherwise who knows what else they would have done. Just the worst service ever.\n(This was in France, by the way)",
    "rating": null,
    "sentiment_label": "A bunch of idiots."
  },
  {
    "text": "My emails and letters get ignored and can't do anything (like close my account) without speaking to my adviser, who is never available. Ridiculous charges imposed too, and without warning me, simply to have a bank account (I'm not overdrawn or anything: it seems to be a French thing to charge you just for having an account, as and when and for however much they wish).",
    "rating": null,
    "sentiment_label": "Highly unimpressed"
  },
  {
    "text": "You pay 35 euros/year for a bank account where there are few branches in the country anyway, and only 1 in 10 of them have tills in that you can deposit money. Don't break your card or lose it they will keep it at the branch yu opened the account in which is often 500km away. You have to fight to get them to do anything for you.\nLazy staff that get paid to do nothing but look smart.",
    "rating": null,
    "sentiment_label": "No words can describe how bad their customer service is."
  },
  {
    "text": "unsatisfied with a quality of service(",
    "rating": null,
    "sentiment_label": "unsatisfied"
  }
]